***

# <center><font size="10" color='Blue'>Machine Learning </font></center>


# <center><font size="6" color='Blue'>Assignment 1 and 2</font></center>

# <center><font size="6" color='Blue'>F2019027004</font></center>

# <center><font size="6" color='Blue'>Muhammad Abdullah Shahid</font></center>

***

***


# <center><font size="10" color='red'>Table of Contents</font></center>

### <font color='blue'>1. Introduction</font>
### <font color='blue'>2. Data Types</font>
    2.1 Variables 
    2.2 Numbers 
    2.3 Strings 
    2.4 Lists 
    2.5 Dictionaries
    2.6 Tuples
    2.7 Sets 
### <font color='blue'>3. Comparison Operators</font>
### <font color='blue'>4. If-Else Statements</font>
### <font color='blue'>5. For & While Loop</font>
### <font color='blue'>6. Functions</font>
### <font color='blue'>7. Lambda Functions</font>
    7.1 Map()
    7.2 filter()
### <font color='blue'>8. File I/O</font>
### <font color='blue'>9. Pandas Library Introduction</font>
### <font color='blue'>10. Series</font>
    10.1 From ndarray
    10.2 From dict
    10.3 From Scalar value
    10.4 Series is ndarray-like
    10.5 Series is dict-like
    10.6 Vectorized operations and label alignment with Series
    10.7 Name Attribute
### <font color='blue'>11. Data Frames</font>
    11.1 From dict of Series or dicts
    11.2 From dict of ndarrays / lists
    11.3 From a list of dicts
    11.4 From a dict of tuples
    11.5 Alternate Constructors
### <font color='blue'>12. Viewing Data</font>
<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>1. Introduction</font></center>
- Python has gathered alot of appreciation as a choice of language for Data Analytics.
- Open Source and Free to install.
- Awesome online community.
- Very easy to learn.
- It can become common language for data science.
- It can also become a common language for production of web based analytics products.
- As it is interpreted programming language so it is easier to implement.
- Compilation is not required, execution process can be done directly.

<br>
<br>
<br>

***

# <center><font size="8" color='red'>2 Data Types</font></center>
Tthere are some datatype that we use in python.

# <font color='blue'>2.1 Variables</font>
<ul> 
<li> In Python we cannot diclear variable python is a very intelligent language it's autometic detect an variable and it's data type also by assigning value and variables occupy memory space in runtype.</li>
<li> The type of the variable will be decided after assigning the value to it.</li>
</ul>

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we diclare 3 variable 1st is counter, 2nd is miles and 3rd is name but when we pass the value than these variables occupy the space in memory according their data type. <font>

In [1]:
counter = 100.00 #float type variable
miles = 100 #integer type variable
name = "Mehvish" #string type variable
#print all values
print (counter)
print (miles)
print (name)

100.0
100
Mehvish

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we also diclare 3 variable pass the values and than check their data type by type() method.

In [2]:
v_myname = 'Abdullah' #we pass string so this will be come string variable
v_intiger = 20 #pass intiger
v_float = 10.5 #float
#print all values

print ("Data type is: " , type(v_myname), "\t and Value is :", v_myname )
print ("Data type is: " , type(v_intiger), "\t and Value is :", v_intiger )
print ("Data type is: " , type(v_float), "\t and Value is :", v_float )

Data type is:  <class 'str'> 	 and Value is : Abdullah
Data type is:  <class 'int'> 	 and Value is : 20
Data type is:  <class 'float'> 	 and Value is : 10.5

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we check datatype and print their value and datatype by placeholder technique using formate() method

In [3]:
num1 = 'Shahid' #we pass string so this will be come string variable
num2 = 24 #pass intiger
num3 = 20.5 #float
#print all values

print ("Value is : {0} \t and Data type is: ".format(num1) , type(num1))
print ("Value is : {0} \t \t and Data type is: ".format(num2) , type(num2))
print ("Value is : {0} \t and Data type is: ".format(num3) , type(num3))

Value is : Shahid 	 and Data type is:  <class 'str'>
Value is : 24 	 	 and Data type is:  <class 'int'>
Value is : 20.5 	 and Data type is:  <class 'float'>

<br>

***

# <font color='blue'>2.2 Numbers</font>
<ul>
<li>This data type stores numeric values.</li>
<li>They are immutable data types (Means changing the value of Number data type will results in a newly allocated object).</li>
Some examples are given below

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we just disply numaric value and perform sume operation on is than (we can add two integer and float values and we can do all math operation ion them).

In [4]:
2  #integer

2

In [5]:
 2+3 #integer

5

In [6]:
 2.3+5.5 #float

7.8

In [7]:
 2**2 #exponent

4

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we just disply numaric value and perform sume operation on is than showing their data type.

In [8]:
10

10

In [9]:
type(10)

int

In [10]:
10+20

30

In [11]:
type(10+20)

int

In [12]:
5.5

5.5

In [13]:
type(5.5)

float

In [14]:
5.5 + 6.6

12.1

In [15]:
type(5.5 + 6.6)

float

In [16]:
5.5 + 3

8.5

In [17]:
type(5.5 + 3)

float

In [18]:
14E4

140000.0

In [19]:
type(14E4)

float

In [20]:
3**3

27

In [21]:
2j + 3j

5j

In [22]:
type(2j + 3j)

complex

### <font color='orange'>Example 3:</font>

<font color='#094B91'>In this exame we perform some math operation on numaric data type like integer, float and complex number

In [23]:
5 #int

5

In [24]:
5.8  # float

5.8

In [25]:
5j   # complex

5j

In [26]:
-5555522 #int

-5555522

In [27]:
18E4 #float

180000.0

In [28]:
-15j

(-0-15j)

<br>

***

# <font color='blue'>2.3 Strings</font>
- String data types are used to store words or combination of words having letters, numbers, special characters etc.
- It can be stored by enclosing within single qoutes ('some string') and double qoutes ("some string") also.
- Python doesn't support char data type. It will be as String of length one in Python.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we simpal pass a string value to a variable with two technique by single qoutes and double qoutes.

In [29]:
name = 'Mehvish'
university = "COMSATS"
print(name,university)

Mehvish COMSATS

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we simpal pass some string value to a variable with two technique by single qoutes and double qoutes. and than display the values of these variables by print() method.

In [30]:
fname = 'Muhammad'
mname = 'Abdullah'
lname = 'Shahid'
universityName = "\n My University name is UMT"

print(fname,mname,lname,universityName)

Muhammad Abdullah Shahid
 My University name is UMT

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we also pass some string value to a variable with two technique by single qoutes and double qoutes. and than display the values of these variables by print() method.

In [31]:
stringVar1 = 'We can store'
stringVar2 = "any letter, word, number, any thing"
stringVar3 = 'in a string varuable'
stringVar4 = "print method concatinate to string variables with blanck space."

print(stringVar1,stringVar2,stringVar3,stringVar4)

We can store any letter, word, number, any thing in a string varuable print method concatinate to string variables with blanck space.

### <font color='green'>2.3.1. Acess values in String</font>
- Python doesn't support Character data type. These are treated as Strings of length one if pass single letter than it will also be string with length 1.
- Square bracket'[]'s are used to access substrings and its represent prosition or index no of that charaector.
- We can access a specific character or range of characters from string.
It would be cleared by using following examples

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we acces an single word like "H" in a string by it's index number and we also can access some indexes by [1:5] and this will show the words from index 1 to index 4.

In [32]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0])
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we acces last index value "!" by index number -1. <br>
In a string by it's index number and we also can access some indexes by [10:15] and this will show the words from index 10 to index 14.<br>
we can write multipule line of strings by triple bouble qoute like """ some lines of string"""

In [33]:
strvar1 = "single line string!"
strvar2 = """Multipule line
string store in
1 string variable"""

print(strvar1[-1]) #whow last index
print("\n") # line brak
print(strvar1) # print complete string
print("\n") # line brak
print(strvar2) # print complete string
print("\n")
print(strvar2[10:15])

!


single line string!


Multipule line
string store in
1 string variable


line

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we acces specific index value "g" by index number 3. <br>
We check the length of string by len() method. <br>
In a string by it's index number and we also can access some indexes by [2:6] and in this example we show some different exmple of this technique.<br>
We can check a letter that is prasent or not in that string by "in" key word

In [34]:
print(strvar1[3]) #single charactor

print(len(strvar1)) # show string length

print(strvar1[2:6]) # show from index 2 to 6 and 6 will not show

print(strvar1[:6]) # show from index 0 to 6 and 6 will not show

print(strvar1[6:]) # show from index 6 to end 

print(strvar1[-1]) # -1 shows last index value

print ('line' in strvar1) # check that word 'line' is in our string orr not

print(strvar2[:18]) # from 0 to 18 but 18 is not include

g
19
ngle
single
 line string!
!
True
Multipule line
str

### <font color='green'>2.3.2. Updating String</font>
- Vwhen we assign a new value of a variable than old value will be overright orr deleted.
- New value must be related (having same data type) to previous value of the string.
- '+' operator will use to updae string from specific index like as follows:

### <font color='orange'>Example 1:</font>

<font color='#094B91'> We can change the complete value of a string variable or we can chande some specific value of string or we can update an string  from some specific index to some specific index

In [35]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python"
print("Updated string: ", stringVariable)

Updated string:  Hello Python

### <font color='orange'>Example 2:</font>

<font color='#094B91'> We can change the complete value of a string variable or we can chande some specific value of string or we can update an string  from some specific index to some specific index. <br>
<br>
Update pravios string variable strvar1 and strvar2

In [36]:
strvar1 = "update string"
strvar2 = strvar2[:10] + "String Update From 10 Index"
print("Updated string strvar1: ", strvar1)
print("Updated string strvar2: ", strvar2)

Updated string strvar1:  update string
Updated string strvar2:  Multipule String Update From 10 Index

### <font color='orange'>Example 3:</font>

<font color='#094B91'> updae string and use some python method for updating string like 
- upper() returns the string in upper case
- lower() returns the string in lower case
- strip() removes any whitespace from the beginning or the end
- replace() replaces a string with another string
- split() returns a list where the text between the specified separator becomes the list items

In [37]:
print(strvar1.upper()) #show string in uper case

print(strvar2.lower()) #show string in lower

print(strvar1.strip()) #remove whitr space from start and end

print(strvar1.replace("update","Modify")) #sreplace word

print(strvar2.split(" ")) #split string after white space

UPDATE STRING
multipule string update from 10 index
update string
Modify string
['Multipule', 'String', 'Update', 'From', '10', 'Index']

### <font color='green'>2.3.3. Delete String</font>
- use del kay word to delete a string variable it will delete its object (reference variable).

### <font color='orange'>Example 1:</font>

<font color='#094B91'> We delete stringVariable  and try to show it's vlue but that line will through some error

In [38]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable

# this lin will show some error
#print (stringVariable)

Hello World

### <font color='orange'>Example 2:</font>

<font color='#094B91'> We delete some string variales and try to show their vlues but that line will through some error.

In [39]:
print(stringVar1, stringVar2, stringVar3, stringVar4) # display all strings vale 

del stringVar1,stringVar2,stringVar3, stringVar4 # delete all strings 
 
#now this will through error
#print(stringVar1, stringVar2, stringVar3, stringVar4)

We can store any letter, word, number, any thing in a string varuable print method concatinate to string variables with blanck space.

### <font color='orange'>Example 3:</font>

 <font color='#094B91'>We delete some string variales and try to show their vlues but that line will through some error

In [40]:
print(strvar1,strvar2) # display all strings vale 

del strvar1, strvar2 # delete all strings

print("\n")

if 'strvar1' in globals():
    print("variable exists")
else:
    print("variable not exists")

update string Multipule String Update From 10 Index


variable not exists

### <font color='green'>2.3.4. String special operators</font>
Some special operators are used in Python to assist the user. These are given below.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> 1. '+' operator is used for concatenation two strings.

In [41]:
variable = "Hello"
print(variable+"Python")

HelloPython

<font color='#094B91'> 2. '*' used of Repetition a string multipul time

In [42]:
 variable = "Hello"
print(variable*3)

HelloHelloHello

<font color='#094B91'> 3. '[]' show a single character of string at given index.

In [43]:
variable = "Hello"
print(variable[1])

e

<font color='#094B91'> 4. '[:]' is used to get a range of characters from string.

In [44]:
variable = "Hello"
print(variable[1:3])

el

<font color='#094B91'> 5. 'in' returns true if given character exists in string, otherwise return false.

In [45]:
 variable = "Hello"
print('H' in variable)

True

<font color='#094B91'> 6. 'not in' returns true if given character doesn't exists in string, otherwise return false.

In [46]:
variable = "Hello"
print('G' not in variable)

True

### <font color='orange'>Example 2:</font>

<font color='#094B91'> 1. '+' operator is used for concatenation two strings.

In [47]:
strvariable = "My Name Is Abdullah Shahid"
print(strvariable +" And This Is My first ML Assignment.")

My Name Is Abdullah Shahid And This Is My first ML Assignment.

<font color='#094B91'> 2. '*' used of Repetition a string multipul time

In [48]:
print(strvariable * 3)

My Name Is Abdullah ShahidMy Name Is Abdullah ShahidMy Name Is Abdullah Shahid

<font color='#094B91'>. '[]' show a single character of string at given index.

In [49]:
print(strvariable[0])

M

<font color='#094B91'>4. '[:]' is used to get a range of characters from string.

In [50]:
print(strvariable[0:19])

My Name Is Abdullah

<font color='#094B91'>5. 'in' returns true if given character exists in string, otherwise return false.

In [51]:
print('Abdullah' in strvariable)

True

<font color='#094B91'>6. 'not in' returns true if given character doesn't exists in string, otherwise return false

In [52]:
print('Ali' not in strvariable)

True

### <font color='orange'>Example 3:</font>

<font color='#094B91'>1. '+' operator is used for concatenation two strings.

In [53]:
strvariable1 = "Python is a"
strvariable2 = "Very Easy and Comprehensive Programing Language"
strvariable3 = strvariable1 + " " + strvariable2
print(strvariable3)

Python is a Very Easy and Comprehensive Programing Language

<font color='#094B91'>2. '*' used of Repetition a string multipul time

In [54]:
strvariable = " Abdullah "
print(strvariable*5)

 Abdullah  Abdullah  Abdullah  Abdullah  Abdullah

<font color='#094B91'>3. '[]' show a single character of string at given index.

In [55]:
print(strvariable3[:-1])

Python is a Very Easy and Comprehensive Programing Languag

<font color='#094B91'>4. '[:]' is used to get a range of characters from string.

In [56]:
print("my name is" in strvariable3)

False

<font color='#094B91'>5. 'in' returns true if given character exists in string, otherwise return false.

In [57]:
print("Python" not in strvariable3)

False

<font color='#094B91'>6. 'not in' returns true if given character doesn't exists in string, otherwise return false

In [58]:
del strvariable, strvariable1, strvariable2, strvariable3

### <font color='green'>2.3.5. String formatting operator</font>
- One of the coolest feature is string formatting operator within print statement.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this Example we pass variable values vy formate operator in formate operator %s reffer the string variable and %d reffer ineter and %f reffer the float variable

In [59]:
print ("My name is %s and age is %d year!" % ("Zara",21))

My name is Zara and age is 21 year!

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this Example we pass variable values vy formate operator in formate operator %s reffer the string variable and %d reffer ineter and %f reffer the float variable

In [60]:
fname = "Abdullah"
lname= "Shahid"
study = "Machine Learning"
strvar = "my name is %s %s and I am a student of %s." %(fname, lname, study)

print(strvar)

my name is Abdullah Shahid and I am a student of Machine Learning.

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this Example we pass variable values vy formate operator in formate operator %s reffer the string variable and %d reffer ineter and %f reffer the float variable

In [61]:
year = 2019
douration = 1.5

strvar = strvar + "\n I start my MCS From %d and I am a member of UMT family from last %.1f year!" %(year,douration)

print(strvar)

my name is Abdullah Shahid and I am a student of Machine Learning.
 I start my MCS From 2019 and I am a member of UMT family from last 1.5 year!

<br>

***

# <font color='blue'>2.4 Lists</font>
- We can store multipule value with different datatype in a List.
- list is lika a array but it can store  different type of data and wen access specific value dy index number
- The 1st index of a list is 0 we can read or write any specific index of a list by index number.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we create a list and store two string values in that list and than pass this list to print metod for showing the list values.

In [62]:
list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create a list and store different type of data like string and integir in that list and than pass this list to print metod for showing the list values.

In [63]:
listLockDown = ['lock down', 15, 'march', 2021]

In [64]:
print(listLockDown)

['lock down', 15, 'march', 2021]

### <font color='orange'>Example 3:</font>


<font color='#094B91'> In this example we create a list and store different type of data like string, integir and float in that list and than pass this list to print metod for showing the list values.

In [65]:
listFrouits = ["apple",200, "banana",150, "cherry", 3.10]

In [66]:
print(listFrouits)

['apple', 200, 'banana', 150, 'cherry', 3.1]

### <font color='green'>2.4.1. Accessing values in Lists</font>
- Square brackets are used to access the values of a list.
- We can access a specific values or range of values from list.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we shows that We can access any vaue that we store in the list by it's index number.

In [67]:
 list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ];
print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

### <font color='orange'>Example 2:</font>


<font color='#094B91'> In this example we shows that We can access any vaue that we store in the list by it's index number.
And we can whw a list with different ways.

In [68]:
listLockDown = ['lock down', 15, 'march', 2021]
print("This list have lockdown Information")

print(listLockDown[0] + "start from " , listLockDown[1] , listLockDown[2] , listLockDown[3])

This list have lockdown Information
lock downstart from  15 march 2021

### <font color='orange'>Example 3:</font>


<font color='#094B91'> In this example we shows that We can access any vaue that we store in the list by it's index number.
And we can whw a list with different ways.

In [69]:
listFrouits = ["apple",200, "banana",150, "cherry", 300]

print(listFrouits[:-1])
print(listFrouits[0:2])
print(listFrouits[2:6])

['apple', 200, 'banana', 150, 'cherry']
['apple', 200]
['banana', 150, 'cherry', 300]

### <font color='green'>2.4.2. Updating Lists</font>
- We can update single or mupltiple elements of a list by giving slice on left hand of the assignment operator.
- It can also be updated using append() function.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> We can chan the complete list and we also can chane the vaue of some specific indexes.

In [70]:
 list1 = ['physics', 'chemistry', 1997, 2000];
list1[1] = "computer science"
print(list1)
list1.append('Computer Science')
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

### <font color='orange'>Example 2:</font>



<font color='#094B91'> We can chan the complete list and we also can chane the vaue of some specific indexes and in this example we add complete list in that list.

In [71]:
listLockDown = [15, "March", 2020, "Last Year Lockdown Date"]

print(listLockDown)

listLockDown = listLockDown + listLockDown

print(listLockDown)

[15, 'March', 2020, 'Last Year Lockdown Date']
[15, 'March', 2020, 'Last Year Lockdown Date', 15, 'March', 2020, 'Last Year Lockdown Date']

### <font color='orange'>Example 3:</font>


<font color='#094B91'> We can chan the complete list and we also can chane the vaue of some specific indexes.

In [72]:
listFrouits[1] = "Mango"
listFrouits[3] = "Peach"
listFrouits[5] = "Guava"

print(listFrouits)

['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

### <font color='green'>2.4.3. Delete List element</font>
- del statement is used to remove when you know the position or index of element to be deleted.
- remove() function can be used when you don't know the position of element to be removed.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> we can remove any index from the list by "del" key word and by remove method. <br>
    If we use del key word than we pass tha index number and if we use remove method than we pass tha value.<br>
    We also use del key word to delete complete list.

In [73]:
list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
del list1[2];
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

In [74]:
list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
list1.remove('chemistry')
print ("After deleting value at index 2 : ")
print (list1)

del list1

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

### <font color='orange'>Example 2:</font>

<font color='#094B91'> we can remove any index from the list by "del" key word and by remove method. <br>
    If we use del key word than we pass tha index number and if we use remove method than we pass tha value.<br>
    We also use del key word to delete complete list.

In [75]:
listLockDown = [15, "March", 2020, "Last Year Lockdown Date"]

print(listLockDown)

listLockDown.remove('March')

print("\n Delete 'Marct' From List :" , listLockDown)

del listLockDown[0]

print("\n Delete index 0 From List :",  listLockDown)

[15, 'March', 2020, 'Last Year Lockdown Date']

 Delete 'Marct' From List : [15, 2020, 'Last Year Lockdown Date']

 Delete index 0 From List : [2020, 'Last Year Lockdown Date']

### <font color='orange'>Example 3:</font>

<font color='#094B91'> we can remove any index from the list by "del" key word and by remove method. <br>
    If we use del key word than we pass tha index number and if we use remove method than we pass tha value.<br>
    We also use del key word to delete complete list.

In [76]:
listFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

print(listFrouits)

del listFrouits[4]

print("\n Delete index 4 From List :",  listFrouits)

del listFrouits, listLockDown

# next line will show error
#print("delete all lists")

['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

 Delete index 4 From List : ['apple', 'Mango', 'banana', 'Peach', 'Guava']

# <font color='blue'>2.5 Dictionaries</font>
- We can store data in Dictionaries as key value pair.
- 1st we write kay than colon ':' and than Value .
- Dictionaries can store multipule values with comma (,) .
- {} represent an emply dictionary.
- keys can not duplicate or empty.
- values can be duplicate or empty.
- The keys must be of an immutable data type such as strings, numbers, or tuples.

### <font color='green'>2.5.1. Accessing value in Dictionary</font>
- We can use the familiar square brackets along with the key to obtain its value.

### <font color='orange'>Example 1:</font>

In this example we store 3 values with 3 unique keys in a Dictionary Variable dict

In [77]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict['Name'])

Mehvish

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we store 3 values with 3 unique keys in a Dictionary Variable student and than print these values with two different ways.

In [78]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

print("Student Id is: ", student['id'])
print("Student Name is: ", student['name'])
print("Student Class is: ", student['class'])

print("All studen dictionary keys are : ", student.keys()) #display All keys
print("All studen dictionary Values are : ", student.values()) #display All values
print("All studen dictionary : ", student.items()) #complete dictionary

Student Id is:  F2019027004
Student Name is:  Abdullah
Student Class is:  10
All studen dictionary keys are :  dict_keys(['id', 'name', 'class'])
All studen dictionary Values are :  dict_values(['F2019027004', 'Abdullah', 10])
All studen dictionary :  dict_items([('id', 'F2019027004'), ('name', 'Abdullah'), ('class', 10)])

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we store 3 values with 3 unique keys in a Dictionary Variable employee and than print these values with two different ways. we can print complete dictionarie or just keys or values or we can print single value also

In [79]:
employee = {"emp_id" : 1001 , "emp_name" : "Ali" , "emp_department": "Sales"}

print("Employee Id is: ", employee['emp_id'])
print("Employee Name is: ", employee['emp_name'])
print("Student Class is: ", employee['emp_department'])

print("All employee dictionary Keys are : ", employee.keys()) #display All keys
print("All employee dictionary Values are : ", employee.values()) #display All values
print("All employee dictionary : ", employee.items()) #complete dictionary

Employee Id is:  1001
Employee Name is:  Ali
Student Class is:  Sales
All employee dictionary Keys are :  dict_keys(['emp_id', 'emp_name', 'emp_department'])
All employee dictionary Values are :  dict_values([1001, 'Ali', 'Sales'])
All employee dictionary :  dict_items([('emp_id', 1001), ('emp_name', 'Ali'), ('emp_department', 'Sales')])

### <font color='green'>2.5.2. Updating Dictionary</font>

- We can update already existing value in dictionary.
- We can also add a new entry in dictionary.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example wo update a value and we add a new key and it's value in a dictionary.

In [80]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "SP14"
print (dict)
dict['University'] = "COMSATS"
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example wo update two values and we add a new key and it's value in a dictionary.

In [81]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

student['id'] = "100"
student['class'] = 12

student.update({'name' : 'Ali'})

print(student.items())

dict_items([('id', '100'), ('name', 'Ali'), ('class', 12)])

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example wo update two values and we add a new key and it's value in a dictionary.

In [82]:
employee = {"emp_id" : 1001 , "emp_name" : "Ali" , "emp_department": "Sales"}

employee['emp_id'] = "2000"
employee['emp_name'] = 'Abdullah'

employee.update({"emp_department": "HR"})

print(employee.items())

dict_items([('emp_id', '2000'), ('emp_name', 'Abdullah'), ('emp_department', 'HR')])

### <font color='green'>2.5.3. Delete Dictionary Element</font>
- We can delete individual element of dicitionary and complete content of dictionary.
- del is used for individual element removal and clear() function is used to remove entire dictionary.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we delete a key 'Batch' from dictionery by del key word and than we remove all values by clear method.

In [83]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
del dict['Batch']
print (dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

In [84]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
dict.clear()
print (dict)

{}

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we delete a key 'id' from dictionery by del key word and remove other key by pop method, pop method return the removing key also and than we remove all values by clear method.

In [85]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

print(student)

del student['id']

print(student)

{'id': 'F2019027004', 'name': 'Abdullah', 'class': 10}
{'name': 'Abdullah', 'class': 10}

In [86]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

print(student)

remove = student.pop("class")

print(student)


print("\nwe remove key 'Class' by pop method and pop return : ", remove)

{'id': 'F2019027004', 'name': 'Abdullah', 'class': 10}
{'id': 'F2019027004', 'name': 'Abdullah'}

we remove key 'Class' by pop method and pop return :  10

In [87]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

student.clear()

print(student)

{}

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we delete a key 'emp_name' from dictionery by del key word and remove other key by pop method, pop method return the removing key also and than we remove all values by clear method.

In [88]:
employee = {"emp_id" : 1001 , "emp_name" : "Ali" , "emp_department": "Sales"}

print(employee)

del employee['emp_name']

print(employee)

{'emp_id': 1001, 'emp_name': 'Ali', 'emp_department': 'Sales'}
{'emp_id': 1001, 'emp_department': 'Sales'}

In [89]:
employee = {"emp_id" : 1001 , "emp_name" : "Ali" , "emp_department": "Sales"}

print(employee)

remove = employee.pop("emp_department")

print(employee)

print("\nwe remove key 'emp_depertment' by pop method and pop return : ", remove)

{'emp_id': 1001, 'emp_name': 'Ali', 'emp_department': 'Sales'}
{'emp_id': 1001, 'emp_name': 'Ali'}

we remove key 'emp_depertment' by pop method and pop return :  Sales

In [90]:
employee = {"emp_id" : 1001 , "emp_name" : "Ali" , "emp_department": "Sales"}

employee.clear()

print(employee)

{}

<br>

***

# <font color='blue'>2.6 Tuples</font>
- Tuple and List are same but can not change orr update tuples.
- Each item in tuple is comma (,) seperated.
- we use () for tuple.
- () is shows empty tuple.
- To write a tuple containing a single value you have to include a comma (,) even though there is only one value.
    For Exampe: tup = (40,).
- It can also have multiple data type values.
- Like string indices, tuple indices start at 0, and they can be sliced, concatenated, and so on.

### <font color='green'>2.6.1. Accessing values in Tuples</font>
- We can use the familiar square brackets along with the index to obtain its value.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we create a tuple variable and save some values in it. than we show complete tuple and show some specific index by it's index number and than we show some index from index 1 to 2.

In [91]:
tup = ('Math','98', 'C programming', '99')
print (tup)
print(tup[1])
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create a tuple variable 'student' and save some dofferent type of data in it. than we show complete tuple and show some specific index by it's index number and than we show some index from index 1 to 4.

In [92]:
student = ("id" , "F2019027004" , "name" , "Abdullah" , "class" , 10)

print(student)
print(student[0])
print(student[1:5])

('id', 'F2019027004', 'name', 'Abdullah', 'class', 10)
id
('F2019027004', 'name', 'Abdullah', 'class')

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we create a tuple variable 'employee' and save some dofferent type of data in it. than we show complete tuple and show some specific index by it's index number and than we show some index from index 1 to 4.

In [93]:
employee = ("emp_id" , 1001 , "emp_name" , "Ali" , "emp_department" , "Sales")
print(employee)
print(employee[5])
print(employee[2:5])

('emp_id', 1001, 'emp_name', 'Ali', 'emp_department', 'Sales')
Sales
('emp_name', 'Ali', 'emp_department')

### <font color='green'>2.6.2. Updating Tuples</font>

<font color='#094B91'> Tuples are immutable means we can't change it. It is read only. we can not change tuple values. If we try to update any tuple value than it will through some error. And we can Add a tuple by '+' Operator.

In [94]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz');

tup3 = tup1 + tup2;
print (tup3);

(12, 34.56, 'abc', 'xyz')

In [95]:
# Following action is not valid for tuples
tup1[0] = 100;

TypeError: 'tuple' object does not support item assignment

### <font color='orange'>Example 2:</font>

<font color='#094B91'> Tuples are immutable means we can't change it. It is read only. we can not change tuple values. If we try to update any tuple value than it will through some error. And we can Add a tuple by '+' Operator.

In [ ]:
student = ("id" , "F2019027004" , "name" , "Abdullah" , "class" , 10)

print(student[1])

student[1] = "1001"

print(student[1])

In [ ]:
student = ("id" , "F2019027004" , "name" , "Abdullah" , "class" , 10)

student2 = ("id" , "F2019027001" , "name" , "Ali" , "class" , 12)

student = student + student2

print(student)

### <font color='orange'>Example 3:</font>

<font color='#094B91'> Tuples are immutable means we can't change it. It is read only. we can not change tuple values. If we try to update any tuple value than it will through some error. And we can Add a tuple by '+' Operator.

In [ ]:
employee = ("emp_id" , 1001 , "emp_name" , "Ali" , "emp_department" , "Sales")
employee2 = (1001 , "Bilal" , "HR")
employee = employee2

print(employee)

### <font color='green'>2.6.3. Delete Tuple elements</font>
- Removing individual element in Tuple is not possible because they can't be updated.
- del statment is used to remove entire Tuple.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we delete a tuple 'tup' by del key word.

In [ ]:
tup = ('physics', 'chemistry', 1997, 2000);
    
print (tup);
del tup;
print ("\nAfter deleting tup : ");
print (tup);

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we delete a tuple 'student' by del key word.

In [ ]:
student = ("id" , "F2019027004" , "name" , "Abdullah" , "class" , 10)

print (student);
del student;

print ("\nAfter deleting student tuple : ");
print (student);

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we delete a tuple 'employee' by del key word.

In [ ]:
employee = ("emp_id" , 1001 , "emp_name" , "Ali" , "emp_department" , "Sales")

print(employee)
del employee

print("\nAfter deleting employee tuple : ")
print(employee)

<br>

***

# <font color='blue'>2.7 Sets</font>

- we can store multipule items in one set variable
- like dictionary we use {} for set also but in set we just store values not keys
- A set is collection of unordered items.
- we can add orr delete item from set but we cant modify any item in set.
- we just store different items into set no item can be duplicate. 
- Sets can be used to perform mathematical set operations like union, intersection, symmetric difference etc.
- {} it's show's an empty set.
- Each item in set will be comma (,) seperated.
- We can make a set from a list using set() function.
- Data type can be found using type() function.
- add() is used to add single value, update() is used for adding multiple values.
- update() function can take tupe, strings, list or other set as argument. In all cases, duplicates will be avoided.
- discard() and remove() are used to to delete particular item from set.
- discard() will not raise an error if item doesn't exists in set.
- remove() will raise an error if item doesn't exists in set.


### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this Example we creat a list and than convert that list into a set data type by using set method and than we creat a new set variable and store some values in it. Than we add a new value 'D' by using add method. Than we remove a value by discard method. we can not use remove method with any set this will through some error.

In [ ]:
#list 
list1 = [1,2,3,4,5]

print (type(list1))

my_set = set(list1)
print(my_set)
print (type(my_set))

# set of integers
my_set = {1,2,3}
print (my_set)

# set of mixed data types
my_set = {1,"Hello",'G', 1.2,'C'}

# adding a single value
my_set.add('D')

#adding multiple values
my_set.update(list1)
print (my_set)

my_set.discard('G') # it will not raise an error
print (my_set)

my_set.remove('G') # it will raise an error

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this Example we creat a list and than convert that list into a set data type by using 'set()' method and than we creat a new set variable and store some values in it. Than we add a new value 'D' by using add method. Than we remove a value by discard method. we can not use remove method with any set this will through some error. And we add two set in a single set variable but set only store unique values no value will be duplicate in set.

In [ ]:
listFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava'] # list

print ("Datatype Of 'listFrouits' is:", type(listFrouits))

setFrouits1 = set(listFrouits)

print ("Datatype Of 'listFrouits' is:", type(setFrouits1))

print("\n Display setFrouits1 : ")
print(setFrouits1)

setFrouits2 = {'apple', 'Mango', 'banana', 100, 200, 300}
print("\n Display new set setFrouits2 : ")
print (setFrouits2)

setFrouits1.update(setFrouits2)
print("\n Update setFrouits1 with setFrouits2 and all items are unique: ")
print(setFrouits1)

setFrouits2.add('pineapple')
listOfmixVar = ['pakistan', 54000]
setFrouits2.update(listOfmixVar)

print("\n Add one single item and a list: ")
print (setFrouits2)

setFrouits2.discard('pineapple') # it will not raise an error
print("\n Remove 'pineapple' from set: ")
print (setFrouits2)

setFrouits2.remove('G') # it will raise an error

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this Example we creat a list and than convert that list into a set data type by using 'set()' method and than we creat a new set variable and store some values in it. Than we add a new value 'D' by using add method. Than we remove a value by discard method. we can not use remove method with any set this will through some error. And we add two set in a single set variable but set only store unique values no value will be duplicate in set.

In [ ]:
setFrouits1 = {'apple', 'Mango', 'banana', 'Peach'}
setFrouits2 = {'banana', 'Peach', 'cherry', 'Guava'}

print("Display setFrouits1 & setFrouits2 boyh have som esame and some different items:")
print(setFrouits1)
print(setFrouits2)
      
setFrouits1.update(setFrouits2)
      
print("\n Update setFrouits1 but only different items will updated:")
print (setFrouits1)


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>3. Comparison Operators</font></center>
- comparison operator use for desision it's check the sreing and number according statement and return true or false.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we use different type of comparicon operaton like <, <=, ==, != , 0r, and. These all operator return some boolian values according the statement.

In [ ]:
1<3

In [ ]:
 15 <= 23

In [ ]:
'Mehvish' == "Zeenat"

In [ ]:
 "Mehvish" != "Mehvish"

In [ ]:
(1==1) or (5 > 2)

In [96]:
 (1 < 2) and (2 < 1)

False

### <font color='orange'>Example 2:</font>


<font color='#094B91'> In this example we use different type of comparicon operaton like <, <=, ==, != , 0r, and. These all operator return some boolian values according the statement.

In [97]:
num1 = 20 
num2 = 15
num3 = 15

print(num1 == num2)
print(num3 == num2)

False
True

In [98]:
print(num1 != num2)
print(num3 != num2)

True
False

In [99]:
print(num1 > num2)
print(num3 > num2)

True
False

In [100]:
print(num3 < num2)
print(num1 < num2)

False
False

In [101]:
print(num1 >= num2)
print(num2 >= num3)
print(num2 >= num1)

True
True
False

In [102]:
print(num1 <= num2)
print(num2 <= num3)
print(num2 <= num1)

False
True
True

In [103]:
print(num1 <= num2 or num2 == num3)
print(num2 > num3 or num1 < num2)
print(num2 <= num1 or num2 <= num3)

True
False
True

In [104]:
print(num1 <= num2 and num2 == num3)
print(num2 > num3 and num1 < num2)
print(num2 <= num1 and num2 <= num3)

False
False
True

### <font color='orange'>Example 3:</font>


<font color='#094B91'> In this example we use different type of comparicon operaton like <, <=, ==, != , 0r, and. These all operator return some boolian values according the statement.

In [105]:
str1 = 'Abdullah'
str2 = 'abdullah'
str3 = 'Abdullah'
str4 = 'Shahid'


print (str1 == str2)
print (str1 == str3)
print (str1 == str4)

False
True
False

In [106]:
print (str1 != str2)
print (str1 != str3)
print (str1 != str4)

True
False
True

In [107]:
print (str1 != str2 or str1 == str3)
print (str1 == str2 or str3 == str4)
print (str1 != str4 or str2 != str3)

True
False
True

In [108]:
print (str1 != str2 and str1 == str3)
print (str1 == str2 and str3 == str4)
print (str1 != str4 and str2 != str3)

True
False
True


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>4. If-Else Statements</font></center>
- If-Else statments are used to make desion and execute a block of code if the condition return true than if block will execute and if statement return false than else block will execute

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we check that 25 is an odd number orr even number.

In [109]:
if 25 % 2 == 0:
    print('Even')
else:
    print('Odd')

Odd

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we store 10 in num1 variable and we store 20 in num 2 variable than we check by if comdition that numbers are equal or not.

In [110]:
num1 = 10
num2 = 20

if (num1 == num2):
    print("num1 and num2 are equal!")
else:
    print("num1 and num2 are not equal!")

num1 and num2 are not equal!

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we use if satement with string data type and than we do some other iperation with if sattement.

In [111]:
str1 = 'Abdullah'
str2 = 'abdullah'

if (str1 != str2):
    print("str1 and str2 are not equal!")
else:
    print("str1 and str2 are equal!")

str1 and str2 are not equal!

In [112]:
if (0):
    print("statement is true !")
else:
    print("statement is not true")

statement is not true

In [113]:
if (1):
    print("statement is true !")
else:
    print("statement is not true")

statement is true !

In [114]:
if (0.11):
    print("statement is true !")
else:
    print("statement is not true")

statement is true !

In [115]:
if ('true'):
    print("statement is true !")
else:
    print("statement is not true")

statement is true !

In [116]:
if ('any thing'):
    print("statement is true !")
else:
    print("statement is not true")

statement is true !

In [117]:
if (''):
    print("statement is true !")
else:
    print("statement is not true")

statement is not true


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>5. For and While Loop</font></center>
- Python has for and while loop for iteration, used when we want to perform a specific a task repeatedly.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we use for loop and find tha factorial of 5 and than we use while loop.

In [118]:
#example of for loop
fact = 1
N = 5
for i in range (1,N+1):
    fact*=i
    print(i)
 
print (fact)

1
2
3
4
5
120

In [119]:
#example of while loop
a = 0
while a < 10:
 a = a+1
 print(a)

1
2
3
4
5
6
7
8
9
10

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we print 0 to 4 digits by using for loop, we use renge method with for loop and pass some parameter to range method in 1st parameter we pass tha start value and in 2nd parament we pass end value and in 3rd parameter we pass incriment value. <br>
And we use for loop with List.

In [120]:
for i in range(5):
  print(i)

0
1
2
3
4

In [121]:
for i in range(4, 10+1):
  print(i)

4
5
6
7
8
9
10

In [122]:
for i in range(0, 10, 2):
  print(i)

0
2
4
6
8

In [123]:
fruits = ["apple", "orange", "mango"]
prise = ["1kg : 100", "2kg : 200", "5kg : 400"]

for i in fruits:
  for j in prise:
    print(i, j)

apple 1kg : 100
apple 2kg : 200
apple 5kg : 400
orange 1kg : 100
orange 2kg : 200
orange 5kg : 400
mango 1kg : 100
mango 2kg : 200
mango 5kg : 400

In [124]:
i = 0
while i < 6:
  i += 1
  if i == 5:
    print("next iteration")
    continue
  print(i)

1
2
3
4
next iteration
6

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we print 0 to 4 digits by using for loop, we use renge method with for loop and pass some parameter to range method in 1st parameter we pass tha start value and in 2nd parament we pass end value and in 3rd parameter we pass incriment value. <br>
And we use for loop with List.

In [125]:
listFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

for i in listFrouits:
  print(i)

apple
Mango
banana
Peach
cherry
Guava

In [126]:
tupleEmployee = ("emp_id" , 1001 , "emp_name" , "Ali" , "emp_department" , "Sales")

for i in listFrouits:
  print(i)

apple
Mango
banana
Peach
cherry
Guava

In [127]:
dictionaryStudent = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

for i in dictionaryStudent:
  print(i)

id
name
class

In [128]:
dictionaryStudent = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

for i in dictionaryStudent:
  print(dictionaryStudent[i])

F2019027004
Abdullah
10

In [129]:
setFrouits = {'Mango', 100, 'pineapple', 'pakistan', 'banana', 200, 300, 54000, 'apple'}

for i in setFrouits:
  print(i)

banana
100
pakistan
200
300
54000
Mango
pineapple
apple

In [130]:
i = 0
while i < 5:
  print(i)
  if (i == 3):
    print("loop end on 1==3 !")
    break
  i += 1

0
1
2
3
loop end on 1==3 !


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>6. Functions</font></center>
- It is a block of organized and reusable code.
- It is used to perform a single, related action.
- It provides high modularity for your application.
- It has a hight degree of code reusing.
- The syntax is:

def functionname( parameters ):

"function_docstring"

function_suite

return [expression]
<br>
<br>
### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we define a function 'printme' that will take a parameter and this function simpley print that parameter.

In [131]:
 # Function definition is here
def printme( str ):
#This prints a passed string into this function
     print (str)
     return;
# Now you can call printme function
printme("I'm first call to user defined function!")

I'm first call to user defined function!

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we define a function add that will take 2 parameter and return the some of these 2 parameters.

In [132]:
def add(x, y):
    return x + y

print(add(3,5))

ans = add(2,2)
print(ans)

8
4

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we define a function 'printlist' taht will take a list as argument and print that list.

In [133]:
def printlist(x):
    for i in x:
        print(i)

listFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

printlist(listFrouits)

apple
Mango
banana
Peach
cherry
Guava


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>7. Lambda Functions</font></center>
- The creation of anonymous functions at runtime, using a construct called "lambda".
- Lambda function doesn't include return statement, it always contains an expression which is returned.
- This piece of code shows the difference between a normal function definition ("f") and a lambda function ("g"):

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we show tha difference between simple function and lamda function that how can we create a lamda function in a single line.

In [134]:
 #Normal function
def f (x):
     return x**2
print (f(8))

64

In [135]:
 #Lambda Function
#lambda expressions
times3 = lambda var:var*3
times3(10)
#lambda expressions: another way to write a function in line

30

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we show tha difference between simple function and lamda function that how can we create a lamda function in a single line.

In [136]:
def add(x, y):
    return x + y

print(add(3,5))

ans = add(2,2)
print(ans)

8
4

In [137]:
add = lambda x,y : x + y

print(add(3,5))
ans = add(2,2)
print(ans)

8
4

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we show tha difference between simple function and lamda function that how can we create a lamda function in a single line.

In [138]:
def myfunc(x):
  return lambda y : y * x

doubler = myfunc(2)
tripler = myfunc(3)

print(doubler(10))
print(tripler(10))

20
30

# <font color='blue'>7.1 Map()</font>
- Map() function is used with two arguments. Just like: r = map(func, seq)
- The first argument func is the name of a function and the second a sequence (e.g. a list).
seq. 
-map() applies the function func to all the elements of the sequence seq. It returns a new list with the elements changed by func.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we use map() method and in first agrument of map method we pass a lamda function and in 2nd argument we pass a string and taht map method will return the length of each word.

In [139]:
sentence = 'It is raining cats and dogs'
words = sentence.split()
print (words)
lengths = map(lambda word: len(word), words)
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we define a function and list of string, taht function return the length of string and we pass this function length and list listFrouits to map method that will return tha length of each list item.

In [140]:
def length(lnt):
    return len(lnt)

listFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

print(map(length,listFrouits))

print(list(map(length,listFrouits)))

<map object at 0x0000029241D33A60>
[5, 5, 6, 5, 6, 5]

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we define a function and 2 list of string, taht function take 2 string parameter and return the concatinate string. We pass this method and 2 lists to map() method.

In [141]:
def concat(w1, w2):
    return w1 + " & " + w2

listFrouits1 = ['apple', 'Mango', 'banana']
listFrouits2 = ['Peach', 'cherry', 'Guava']

print(map(concat ,listFrouits1, listFrouits2))

print(list(map(concat ,listFrouits1, listFrouits2)))

<map object at 0x0000029241D33880>
['apple & Peach', 'Mango & cherry', 'banana & Guava']

# <font color='blue'>7.2 Filter()</font>
- The function filter(function, list) offers an elegant way to filter out all the elements of a list.
- The function filter(f,l) needs a function f as its first argument. f returns a Boolean value, i.e. either True or False.
- This function will be applied to every element of the list l.
- Only if f returns True will the element of the list be included in the result list.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we pass a lamda function and a list to filter method that will return odd number from list.
and in next example filter methor return even number from list.

In [142]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [143]:
 fib = [0,1,1,2,3,5,8,13,21,34,55]
result2 = filter(lambda x: x % 2 == 0, fib)
list (result2)

[0, 2, 8, 34]

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create a list and than pass a lamda function and list to filter method that will return odd number from list.
and in next example filter methor return even number from list.

In [144]:
listOfNum = []

for i in range(30):
    listOfNum.append(i)

odd = filter(lambda x: x % 2 == 1, listOfNum)

print("show all list:")
print(listOfNum)

print("\n print odd list:")
print(list(odd))

show all list:
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]

 print odd list:
[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29]

In [145]:
listOfNum = []

for i in range(0,30,3):
    listOfNum.insert(i,i)

even = filter(lambda x: x % 2 == 0, listOfNum)

print("show all list:")
print(listOfNum)

print("\n print even list:")
print(list(even))

show all list:
[0, 3, 6, 9, 12, 15, 18, 21, 24, 27]

 print even list:
[0, 6, 12, 18, 24]

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we define a m=function and create a list and than pass this function and list to filter method that method will retun that list element which length is grater than 5.

In [146]:

def checklen(w):
    if(len(w) > 5):
        return 1
    else:
        return 0
        

listFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

listFrouits2 = filter(checklen, listFrouits)

print(list(listFrouits2))

['banana', 'cherry']

In [147]:
def checklen(w):
    if(len(w) < 6):
        return 1
    else:
        return 0
        

listFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']

listFrouits2 = filter(checklen, listFrouits)

print(list(listFrouits2))

['apple', 'Mango', 'Peach', 'Guava']


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>8. File I/O</font></center>
- In this section, we'll cover all basic I/O function(methods).

# <font color='blue'>8.1 Reading input from Keyboard</font>
- For reading input from keyboard, raw_input() method is used.
- It reads only one line from standard input and returns it as a string.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this Example we import a input method from six.movies python laibrary and than take some input from user and print output on secreen.

In [148]:
#import input function from six.moves python library 
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name: Abdullah
Abdullah

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we take two input from user and than print that input on secreen.

In [149]:
fname = input("Please enter your firstname: ")

lname = input("Please enter your lastname: ")

print("\n")
print(fname,lname)

Please enter your firstname: Abdullah
Please enter your lastname: Shahid


Abdullah Shahid

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we take two integer from user and than check that input and after that we add that number and print that result on secreen.

In [150]:
def check_user_input(val):
    while(1):
        try:
            # Convert it into integer
            val = int(val)
            return val
        except ValueError:
            val = input("No.. input is not a intiger. Please Enter Value Again:")


print("Enter 2 intiger values program will calculate the sum of these two numbers!")

value1 = input("Please enter first intiger value: ")
value1 = check_user_input(value1)

value2 = input("Please enter second intiger value: ")
value2 = check_user_input(value2)

print("\n")
print("Answer: ", value1 + value2)

Enter 2 intiger values program will calculate the sum of these two numbers!
Please enter first intiger value: 44
Please enter second intiger value: 55


Answer:  99

# <font color='blue'>8.2 I/O from or to Text File</font>
- In this scenario, we'll read and write to a text file.
    - r opens a file in read only mode.
    - r+ opens a file read and write mode.
    - w opens a file in write mode only.
    - a opens a file in append mode
    - a+ opens a file in append and read mode.
    
    ### <font color='red'> This attribute 'r+' 'open("file.txt", "r+")' through error if file not exist

   ### <font color='orange'>Example 1:</font>
   
  <font color='#094B91'>  In this example we try to open a file in read mode but that file is not exist so this open method will through some error.

In [151]:
# Open a file to read
fileOpen = open("file.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). 
                        #It will read 12 characters from the start of file
print (str)
                        # Close opend file
fileOpen.close()

FileNotFoundError: [Errno 2] No such file or directory: 'file.txt'

### <font color='red'> this append attribute (a+) 'open("file.txt", "a+")' create file if file not exist
    
<font color='#094B91'> we open a file in append mode so if file will not exist than this method create a wile and next line we use write method and write some string on file  and close the file. <br>
    <br>
after taht we open file in read mode and store the file data in a variable and than frint all data on secreen.

In [152]:
 # Open a file to append
fileOpen = open("file.txt", "a+")
fileOpen.write(" Information Technology Lahore");
fileOpen.close()
# Open a file to read
fileOpen = open("file.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12).
                            #It will read 12 characters from the start of file
print (string)
# Close opend file
fileOpen.close()

 Information Technology Lahore

### <font color='orange'>Example 2:</font>

<font color='#094B91'>
    
- The open() function takes two parameters; filename, and mode.
In this example we open a file in append mode and that will crete a new file and write some data on taht file and than close tha afile after taht we open that file in read mode and store all file data on a variable and display on secreen after taht we close that file.

In [153]:
myfile = open('myfile.txt', 'a+')

myfile.write("Hello! Welcome to myfile.txt")

myfile.close()

In [154]:
myfile =  open("myfile.txt", "r+")
filedata = myfile.read()

print(filedata)
myfile.close()

Hello! Welcome to myfile.txt

### <font color='orange'>Example 3:</font>

<font color='#094B91'>
    
- In this example we open file in write mood and write multipule line on that file and than close that file.
- After taht we open file in read mode and write srtore all file data on a variable and print on secreen.

In [155]:
myfile = open('myfile.txt', 'w')

myfile.write("""Hello! Welcome to myfile.txt
This file is create for learning file handling in python
and this file is creat by python.""")

myfile.close()

In [156]:
myfile =  open("myfile.txt", "r+")
filedata = myfile.read()

print(filedata)
myfile.close()

Hello! Welcome to myfile.txt
This file is create for learning file handling in python
and this file is creat by python.

<font color='#094B91'> 
    
- in this example we open file in read mode and reade first 5 charactor of taht file and than print charactor on secreen.

In [157]:
myfile =  open("myfile.txt", "r+")
filedata = myfile.read(5)

print(filedata)
myfile.close()

Hello

In [158]:
myfile =  open("myfile.txt", "r+")
filedata = myfile.readline()

print(filedata)
myfile.close()

Hello! Welcome to myfile.txt

<font color='#094B91'>
    
- In this line we use readline method that method read one line from file.

In [159]:
myfile =  open("myfile.txt", "r+")
filedata = myfile.readline()
print(filedata)

filedata = myfile.readline()
print(filedata)

myfile.close()

Hello! Welcome to myfile.txt

This file is create for learning file handling in python

# <font color='blue'>8.3 File Position</font>
- tell() method tells the currenct position within the file.
- seek() method changes the current file location.

### <font color='orange'>Example 1:</font>

<font color='#094B91'>
    
- In this example we use tell() and seek() method tell method will return tha current pointer and we can change the position by seek method.

In [160]:
 # Open a file
fo = open("file.txt", "r+")
str = fo.read(10);
print ("Read String is : \n", str)

# Check current position
position = fo.tell();
print ("Current file position : \n", position)

# Reposition pointer at the beginning once again
position = fo.seek(0, 0);
print ("\n Current file position after seek: \n", position)
str = fo.read(10);
print ("Again read String is : \n", str)
# Close opend file
fo.close()

Read String is :
  Informati
Current file position :
 10

 Current file position after seek:
 0
Again read String is :
  Informati

<font color='#094B91'>

- In this example we import os library, with the help of this library we can change tha file name and we can delete tha file.

In [161]:
 import os
# rename a file
os.rename("file.txt", "newfile.txt")

In [162]:
 #remove file
os.remove("newfile.txt")

### <font color='orange'>Example 2:</font>

<font color='#094B91'>
    
    
- In this example we use tell() and seek() method tell method will return tha current pointer and we can change the position by seek method.

In [163]:
myfile =  open("myfile.txt", "r+")
filedata = myfile.read(5)

print(filedata)

# Check current position
currentPosition = myfile.tell();
print ("Current pointer position is: ", currentPosition)

currentPosition = myfile.seek(0, 0);
print ("Current pointer position is: ", currentPosition)

filedata = myfile.read(5)

print(filedata)

# Check current position
currentPosition = myfile.tell();
print ("Current pointer position is: ", currentPosition)

myfile.close()

Hello
Current pointer position is:  5
Current pointer position is:  0
Hello
Current pointer position is:  5

### <font color='orange'>Example 3:</font>

<font color='#094B91'>
    
- In this example we use tell() and seek() method tell method will return tha current pointer and we can change the position by seek method.

In [164]:
# use python context manager for file handling
with open("myfile.txt", "r+") as f:
    filedata = f.readline()

    print(filedata)

    # Check current position
    currentPosition = f.tell();
    print ("Current pointer position is: ", currentPosition)

    currentPosition = f.seek(0, 0);
    print ("\nCurrent pointer position is: ", currentPosition)

    filedata = f.read(5)

    print(filedata)

#file auto close

Hello! Welcome to myfile.txt

Current pointer position is:  30

Current pointer position is:  0
Hello

<font color='#094B91'>

- In this example we import os library, with the help of this library we can change tha file name and we can delete tha file.

In [165]:
 import os

os.rename("myfile.txt", "mynewfile.txt")

In [166]:
import os
if os.path.exists("mynewfile.txt"):
    os.remove("mynewfile.txt")
    print("Delete Successfully..!!")
else:
  print("The file does not exist")

Delete Successfully..!!


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>9. Pandas Introduction</font></center>
- Pandas is an open source library built on top of NumPy
- It allows for fast analysis and data cleaning and preparation
- It excels in proformance and productivity
- It also has built-in visualization features
- It can work with data from a wide variety of sources

<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>10. Series</font></center>
- A series is very similar to NumPy array.
- Series is 1-D array labeled array capable of holding any type of data.
- The difference between the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of
just a number location
- The axis labels are collectively referred to as the index.
- Following function is used to create a series:

s= pd.Series(data,index = index)
- In above function, data can be many different things:
    - A python dict
    - An ndarray
    - A scalar value (For exmple: 5)
-The passed index is a list of axis labels. So, this seperates into a few cases depending on what data is:
    
# <font color='blue'>10.1 From ndarray</font>
- If data is an ndarray, index must be the same length as data.
- If no index is passed, one will be created having values [0, ..., len(data) - 1].

### <font color='orange'>Example 1:</font>

<font color='#094B91'>In This example we import 3 python labraries 1st is panda, 2nd is numpy and 3rd is matplotlib and than we create a panda series of 5 indexis and we pass 2 argumrnt in 1st argument we pass array taht generate by randn() method and in 2nd argument we pass a index list.</font>

In [167]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
"""following a fucntion is called from panas to create a series.
 data would be 5 random values and indexes are assigned a-e"""
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -0.286911
b   -1.123318
c   -1.265836
d    0.125318
e    0.488960
dtype: float64

<font color='#094B91'> In this example we use index property to display all indexes</font>

In [168]:
 """Following function will print the index and its datatype"""
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

<font color='#094B91'> In this example we just pass 5 indexes array to series method and that series will assign index auto from 0 to onword</font>

In [169]:
 """If we don't assign the index then it will of length having values [0......len(data-1)]"""
pd.Series(np.random.randn(5))

0    2.050616
1    0.407049
2   -0.694842
3   -1.287606
4    0.222989
dtype: float64

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we also import 3 labrary and than with the help of pandas labrary we create an series and we pass one ndarray and a list of index to series method. </font>

In [170]:
import pandas as pnd
import numpy as npy
import matplotlib.pyplot as mpy

pandasSeries = pnd.Series(npy.random.randn(6), index=['a', 'e', 'i', 'o', 'u','z'])

print(pandasSeries)

a   -0.765989
e    0.082932
i    1.167352
o    0.598475
u   -3.032106
z   -0.451145
dtype: float64

<font color='#094B91'> In this example we use index property to see all indexes.</font>

In [171]:
pandasSeries.index

Index(['a', 'e', 'i', 'o', 'u', 'z'], dtype='object')

<font color='#094B91'> In this example we just pass the ndarray to seriers method.</font>

In [172]:
pnd.Series(npy.random.randn(6))

0   -0.491791
1    0.140052
2   -0.965040
3    1.383575
4    1.228074
5   -0.110615
dtype: float64

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we create two list one for ndarray and 2nd for index than we pass these lists to pandas.series method and create a pandas series and than display this series </font>

In [173]:

ndFrouits = ['apple', 'Mango', 'banana', 'Peach', 'cherry', 'Guava']
index=['a', 'b', 'c', 'd', 'e','f']

pandasSeries = pnd.Series( ndFrouits, index)

print(pandasSeries)

a     apple
b     Mango
c    banana
d     Peach
e    cherry
f     Guava
dtype: object

<font color='#094B91'> In this example we use index property to displsy all indexes.</font>

In [174]:
pandasSeries.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

<font color='#094B91'> In this example we just pass array to series and this series method will give the index from 0 to onword. </font>

In [175]:
pnd.Series( ndFrouits)

0     apple
1     Mango
2    banana
3     Peach
4    cherry
5     Guava
dtype: object

# <font color='blue'>10.2 From dict</font>
- If data is a dict, if index is passed the values in data corresponding to the labels in the index will be pulled out.
- If index is not passed then it will be constructed from the sorted keys of the dict, if possible.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we pass a dictonary to series method and taht method will use the keys as indexes and use the value os of that dectionary as index.</font>

In [176]:
 """ In following example, indexes are not given to it is constructed from the sorted keys of the dict"""
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

<font color='#094B91'> In this example we pass a dictonary to series method and taht method will use the keys as indexes and use the value os of that dectionary as index. But we pass a index list that index list will overwrite the dectionary keys.</font>

In [177]:
 """ In following example, index are given, so the values in data corresponding in the index will be pulled ou
t"""
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we pass a dictonary to series method and taht method will use the keys as indexes and use the value os of that dectionary as index.</font>

In [178]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

pnd.Series(student)

id       F2019027004
name        Abdullah
class             10
dtype: object

<font color='#094B91'> In this example we pass a dictonary to series method and taht method will use the keys as indexes and use the value os of that dectionary as index. But we pass a index list that index list will overwrite the dectionary keys.</font>

In [179]:
pnd.Series(student, index=['id', 'b', 'name', 'd', 'e','class'])

id       F2019027004
b                NaN
name        Abdullah
d                NaN
e                NaN
class             10
dtype: object

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we pass a dictonary to series method and taht method will use the keys as indexes and use the value os of that dectionary as index.</font>

In [180]:
employee = {"emp_id" : 1001 , "emp_name" : "Ali" , "emp_department": "Sales"}
pnd.Series(employee)

emp_id             1001
emp_name            Ali
emp_department    Sales
dtype: object

<font color='#094B91'> In this example we pass a dictonary to series method and taht method will use the keys as indexes and use the value os of that dectionary as index. But we pass a index list that index list will overwrite the dectionary keys.</font>

In [181]:
index=['emp_id', 'b', 'emp_name', 'emp_department']

pnd.Series(employee,index)

emp_id             1001
b                   NaN
emp_name            Ali
emp_department    Sales
dtype: object

# <font color='blue'>10.3 From a scalar value</font>
- If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we pass a scalar value '5' and an index list to series method that will create a series and give a same value '5' to each index. </font>

In [182]:
"""In following example, a scalar value is given as data so it will be repeated to match the length of inde
x"""
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we pass a scalar value '100.100' and an index list to series method that will create a series and give a same value '100.100' to each index. </font>

In [183]:
pnd.Series(100.100, index = ['id-1','id-2','id-3','id-4','id-5','id-6'])

id-1    100.1
id-2    100.1
id-3    100.1
id-4    100.1
id-5    100.1
id-6    100.1
dtype: float64

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we pass a string scalar value 'Pass' and an index list to series method that will create a series and give a same value 'Pass' to each index. </font>

In [184]:
pnd.Series("Pass", index = ['student-1','student-2','student-3','student-4','student-5','student-6'])

student-1    Pass
student-2    Pass
student-3    Pass
student-4    Pass
student-5    Pass
student-6    Pass
dtype: object

# <font color='blue'>10.4 Series is ndarray-like</font>
- It acts very similarly to a ndarray.
- It is a valid argument to most NumPy functions. However, things like slicing also slice the index.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we will see that we cann do all same operation on series that we can do on ndarray.
<br>
so we can get a specific index value by it's indes number and we can get some indexes by colon.
</font>

In [185]:
#we can access a value just like ndarray
#access single value
s[0]

-0.286911331565645

In [186]:
 #access range of values
s[:5]

a   -0.286911
b   -1.123318
c   -1.265836
d    0.125318
e    0.488960
dtype: float64

<font color='#094B91'> Pandas Series variable have some specific metods. we can get tha median value of series by using median() method and in this example we get all valuess that are grater than median values.  </font>

In [187]:
 """ Following example will return a range of values in series whose value is greater than the median of serie
s"""
    
s[s > s.median()]

d    0.125318
e    0.488960
dtype: float64

<font color='#094B91'> In this example we get some random index by it's index number. </font>

In [188]:
 """Following example is return the values in series with indexes. 4,3,1 are the positions of the indexs
 For example: the index at 4,3,1 are e,d,b respectively"""
s[[4, 3, 1]]

e    0.488960
d    0.125318
b   -1.123318
dtype: float64

<font color='#094B91'> In this example we use a pandas method exp() it's take a series as argument and it will return the exponent value off all series.  </font>

In [189]:
 """ Following example returns the exponent values. just like e^a (here a is index and its respective data is
placed here)"""
np.exp(s)

a    0.750578
b    0.325199
c    0.282004
d    1.133509
e    1.630620
dtype: float64

<font color='#094B91'> We can get an index value by index number and by index name. </font>

In [190]:
 """Following example will get the data of given index"""
s['a']

-0.286911331565645

<font color='#094B91'> In this example We change an index value. </font>

In [191]:
 """Following example will update the data of the given index"""
s['e'] = 12.

s # before updating e = 1.399281 but after updating e = 12.000000

a    -0.286911
b    -1.123318
c    -1.265836
d     0.125318
e    12.000000
dtype: float64

<font color='#094B91'> In this example we check that an index 'e' is prasent in series or not. that will return an boolian value. </font>

In [192]:
 """ Following will return true if 'e' is in the values of index otherwise false"""
    
'e' in s

True

<font color='#094B91'>  If we pass a index that is not prasent in series than that will through some error.</font>

In [193]:
 """If a label is not contained and you are trying to access its data, an exception is raised: """

# This will create error

s['f']

KeyError: 'f'

<font color='#094B91'> In this example we use get method that will return the value of specific index and we can set some default value is that index is not prasent init. </font>

In [194]:
 """Using the get method, a missing label will return None or specified default"""
s.get('f') #it will return none

s.get('f', np.nan) #it will return default value

nan

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we will see that we cann do all same operation on series that we can do on ndarray.
<br>
so we can get a specific index value by it's indes number and we can get some indexes by colon. 
<br>
In this example we pass an tuple and index list to series.
</font>

In [195]:
tupleNum = (100, 200, 30, 50, 150, 300)
index=['a', 'b', 'c', 'd', 'e','f']

pandasSeries1 = pnd.Series( tupleNum, index)

In [196]:
pandasSeries1[0]

100

In [197]:
pandasSeries1[:6]

a    100
b    200
c     30
d     50
e    150
f    300
dtype: int64

<font color='#094B91'> Pandas Series variable have some specific metods. we can get tha median value of series by using median() method and in this example we get all valuess that are grater than median values.  </font>

In [198]:
pandasSeries1[pandasSeries1 < pandasSeries1.median()]

a    100
c     30
d     50
dtype: int64

<font color='#094B91'> In this example we get some random index by it's index number. </font>

In [199]:
pandasSeries1[[1, 5, 4]]

b    200
f    300
e    150
dtype: int64

<font color='#094B91'> In this example we use a pandas method exp() it's take a series as argument and it will return the exponent value off all series.  </font>

In [200]:
npy.exp(pandasSeries1)

a     2.688117e+43
b     7.225974e+86
c     1.068647e+13
d     5.184706e+21
e     1.393710e+65
f    1.942426e+130
dtype: float64

<font color='#094B91'> We can get an index value by index number and by index name. </font>

In [201]:
pandasSeries1['d']

50

<font color='#094B91'> In this example We change an index value. </font>

In [202]:
pandasSeries1['d'] = 30

In [203]:
pandasSeries1['d']

30

<font color='#094B91'> In this example we check that an index 'e' is prasent in series or not. that will return an boolian value. </font>

In [204]:
'f' in pandasSeries1

True

<font color='#094B91'> In this example we use get method that will return the value of specific index and we can set some default value is that index is not prasent init. </font>

In [205]:
pandasSeries1.get('z')

In [206]:
pandasSeries1.get('z', npy.nan)

nan

<font color='#094B91'>  If we pass a index that is not prasent in series than that will through some error.</font>

In [207]:
# this will show error because 'z' is not in data

pandasSeries1['z']

KeyError: 'z'

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we will see that we cann do all same operation on series that we can do on ndarray.
<br>
so we can get a specific index value by it's indes number and we can get some indexes by colon. 
<br>
In this example we pass an dectionary and index list to series.
</font>

In [208]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

pandasSeries2 = pnd.Series(student)

In [209]:
pandasSeries2[0]

'F2019027004'

In [210]:
pandasSeries2[0:6]

id       F2019027004
name        Abdullah
class             10
dtype: object

<font color='#094B91'> In this example we get some random index by it's index number. </font>

In [211]:
pandasSeries2[[0, 2]]

id       F2019027004
class             10
dtype: object

<font color='#094B91'> We can get an index value by index number and by index name. </font>

In [212]:
pandasSeries2['class']

10

<font color='#094B91'> In this example We change an index value. </font>

In [213]:
pandasSeries2['class'] = 12

In [214]:
pandasSeries2['class']

12

<font color='#094B91'> In this example we check that an index 'e' is prasent in series or not. that will return an boolian value. </font>

In [215]:
'class' in pandasSeries2

True

<font color='#094B91'> In this example we use get method that will return the value of specific index and we can set some default value is that index is not prasent init. </font>

In [216]:
pandasSeries2.get('fname')

In [217]:
pandasSeries2.get('fname', npy.nan)

nan

<font color='#094B91'>  If we pass a index that is not prasent in series than that will through some error.</font>

In [218]:
# this will show error because 'fname' is not in data
pandasSeries2['fname']

KeyError: 'fname'

# <font color='blue'>10.6 Vectorized operations and label alignment with Series</font>
- When doing data analysis, as with raw NumPy arrays looping through Series value-by-value is usually not necessary.
- Series can also be passed into most NumPy methods expecting an ndarray.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we do some mathamatic operation with series and that applyed on each value of list. </font>

In [219]:
 """following will add the data of respective values of indexes. For example, in given output, it is calculate
d as:
a = s['a'] + s['a']
b = s['b'] + s['b']
c = s['c'] + s['c']
d = s['d'] + s['d']
e = s['e'] + s['e']
"""
s + s

a    -0.573823
b    -2.246637
c    -2.531671
d     0.250636
e    24.000000
dtype: float64

In [220]:
 """following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca
lculated as:
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2
e = s['e'] *2"""
s * 2

a    -0.573823
b    -2.246637
c    -2.531671
d     0.250636
e    24.000000
dtype: float64

In [221]:
s = pd.Series(np.random.randn(5), name='something')
s

0   -1.017307
1    0.388766
2   -0.473815
3    2.067004
4    1.907148
Name: something, dtype: float64

In [222]:
 s.name #print the name attribute of series

'something'

In [223]:
 #rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects.
s2 = s.rename("different")
s2.name

'different'

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we do some mathamatic operation with series and that applyed on each value of list. </font>

In [224]:
pandasSeries1 + pandasSeries1

a    200
b    400
c     60
d     60
e    300
f    600
dtype: int64

In [225]:
tupleNum = (100, 200, 30, 50, 150, 300)

pandasSeries1 = pnd.Series( tupleNum, name='tupleNum')

pandasSeries1

0    100
1    200
2     30
3     50
4    150
5    300
Name: tupleNum, dtype: int64

In [226]:
pandasSeries1.name

'tupleNum'

In [227]:
pandasSeries11 = pandasSeries1.rename("pandasSeries11")

pandasSeries11.name

'pandasSeries11'

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we do some mathamatic operation with series and that applyed on each value of list. </font>

In [228]:
pandasSeries2 + pandasSeries2

id       F2019027004F2019027004
name           AbdullahAbdullah
class                        24
dtype: object

In [229]:
student = {"id" : "F2019027004" , "name" : "Abdullah" , "class": 10}

pandasSeries2 = pnd.Series( student, name='Student Record')

pandasSeries2

id       F2019027004
name        Abdullah
class             10
Name: Student Record, dtype: object

In [230]:
pandasSeries2.name

'Student Record'

In [231]:
pandasSeries22 = pandasSeries2.rename("pandasSeries2")
pandasSeries22.name

'pandasSeries2'


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>11. Data Frames</font></center>
- DataFrames are the workhorse of pandas and are directly inspired by the R programming language.
- Like Series, DataFrame accepts many different kinds of input:
    - Dict of 1D ndarrays, lists, dicts, or Series
    - 2-D numpy.ndarray
    - Structured or record ndarray
    - A Series
    - Another DataFrame
- Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments.
- If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame.
- Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.
- If axis labels are not passed, they will be constructed from the input data based on common sense rules

# <font color='blue'>11.1 From dict of Series or dicts<font>
- The result index will be the union of the indexes of the various Series.
- If there are any nested dicts, these will be first converted to Series.
- If no columns are passed, the columns will be the sorted list of dict keys.
    
### <font color='orange'>Example 1:</font>
    
    
<font color='#094B91'> In this example we 1st create a dictionary of pandas series and than pass this array to pandas DataFrame method that will creat a dataframe according that dictionary. </font>

In [232]:
 """ A dict is created """
d = {
 'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
 'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
 }
"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it 
 will be sorted list of dict keys"""
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

<font color='#094B91'> In this example we give come lable to dataframe rows. </font>

In [233]:
 """ a data frame will be constructed for given row labels"""
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

<font color='#094B91'> In this example we give somelabel to dataframe rows and columns. </font>

In [234]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

<font color='#094B91'> In this example we show the columns and their data type by using dataframe property columns.   </font>

In [235]:
 df.columns

Index(['one', 'two'], dtype='object')

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we 1st create a dictionary of pandas series and than pass this array to pandas DataFrame method that will creat a dataframe according that dictionary. </font>

In [236]:
dict1 = {
 'Rec_1' : pnd.Series([10, 20, 30], index=['1', '2', '3']),
 'Rec_2' : pnd.Series([100., 200., 300., 400.,500., 600.], index=['1', '2', '3', '4','5','6'])
 }

dataFrame1 = pnd.DataFrame(dict1)
dataFrame1

   Rec_1  Rec_2
1   10.0  100.0
2   20.0  200.0
3   30.0  300.0
4    NaN  400.0
5    NaN  500.0
6    NaN  600.0

<font color='#094B91'> In this example we give come lable to dataframe rows. </font>

In [237]:
pnd.DataFrame(dataFrame1, index=['1', '5', '6'])

   Rec_1  Rec_2
1   10.0  100.0
5    NaN  500.0
6    NaN  600.0

<font color='#094B91'> In this example we give somelabel to dataframe rows and columns. </font>

In [238]:
pnd.DataFrame(dataFrame1, index=['1', '5', '6'], columns= ['Rec_1','Rec_2','Rec_3','Rec_4'])

   Rec_1  Rec_2  Rec_3  Rec_4
1   10.0  100.0    NaN    NaN
5    NaN  500.0    NaN    NaN
6    NaN  600.0    NaN    NaN

<font color='#094B91'> In this example we show the columns and their data type by using dataframe property columns.   </font>

In [239]:
dataFrame1.columns

Index(['Rec_1', 'Rec_2'], dtype='object')

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we 1st create a dictionary of pandas series and than pass this array to pandas DataFrame method that will creat a dataframe according that dictionary. </font>

In [240]:
student1 = {"id" : "F2019027004" , "name" : "Abdullah" , "city" : "Lahore" , "class": 10}
student2 = {"id" : "F2019027044" , "name" : "Muzamil" , "class": 12}

dict2 = {
 'S-1' : pnd.Series(student1),
 'S-2' : pnd.Series(student2)
 }

dataFrame2 = pnd.DataFrame(dict2)
dataFrame2

               S-1          S-2
city        Lahore          NaN
class           10           12
id     F2019027004  F2019027044
name      Abdullah      Muzamil

<font color='#094B91'> In this example we give come lable to dataframe rows. </font>

In [241]:
pnd.DataFrame(dataFrame2, index=['id', 'city'])

              S-1          S-2
id    F2019027004  F2019027044
city       Lahore          NaN

<font color='#094B91'> In this example we give somelabel to dataframe rows and columns. </font>

In [242]:
pnd.DataFrame(dataFrame2, index=['id', 'city'], columns= ['S-1','S-2','Rec_3','Rec_4'])

              S-1          S-2  Rec_3  Rec_4
id    F2019027004  F2019027044    NaN    NaN
city       Lahore          NaN    NaN    NaN

<font color='#094B91'> In this example we show the columns and their data type by using dataframe property columns.   </font>

In [243]:
dataFrame2.columns

Index(['S-1', 'S-2'], dtype='object')

# <font color='blue'>11.2 From dict of ndarrays / lists</font>
- The ndarrays must all be the same length.
- If an index is passed, it must clearly also be the same length as the arrays.
- If no index is passed, the result will be range(n), where n is the array length.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we create a dectionary of ndarray or list and than pass this dictionary to dataframe method as argument and also pass a other list for index than that method will convert that dictionary into DataFrame.  </font>

In [244]:
"""followind examples shows that ndarray has same length"""
d = {
 'one' : [1., 2., 3., 4.],
 'two' : [4., 3., 2., 1.]
 }
"""column labels are not given so the result will be range(n), where n is the array length"""

'column labels are not given so the result will be range(n), where n is the array length'

In [245]:
 """If indexs are given then it would be same length as arrays"""
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

<font color='#094B91'> In this example we create a list of dectionary  and than pass this list to dataframe method as argument that method will convert that list into DataFrame.  </font>

In [246]:
 """constructing data frame from a list of dicts"""
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

<font color='#094B91'> Now we pass the list and index. </font>

In [247]:
 """passing list of dicts as data and indexes (row labels)"""
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

<font color='#094B91'> In this example we pass list and colimn list for column lable. </font>

In [248]:
 """passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create a dectionary of ndarray or list and than pass this dictionary to dataframe method as argument and also pass a other list for index than that method will convert that dictionary into DataFrame.  </font>

In [249]:
ndarray1 = {
 'Rec_1' : [10, 20, 30, 40, 50, 60],
 'Rec_2' : [100., 200., 300., 400.,500., 600.]
 }

In [250]:
pnd.DataFrame(ndarray1, index=['a', 'b', 'c', 'd','e','g'])

   Rec_1  Rec_2
a     10  100.0
b     20  200.0
c     30  300.0
d     40  400.0
e     50  500.0
g     60  600.0

<font color='#094B91'> In this example we create a list of dectionary  and than pass this list to dataframe method as argument that method will convert that list into DataFrame.  </font>

In [251]:
dictList1 = [{'c1':100, 'c2':200, 'c3':30, 'c4':50, 'c5':150, 'c6':300}, {'c1':1000., 'c2':2000., 'c3':3000.}]

pnd.DataFrame(dictList1)

       c1      c2      c3    c4     c5     c6
0   100.0   200.0    30.0  50.0  150.0  300.0
1  1000.0  2000.0  3000.0   NaN    NaN    NaN

<font color='#094B91'> Now we pass the list and index for the index lable. </font>

In [252]:
pnd.DataFrame(dictList1, index=['Row_1', 'Row_2'])

           c1      c2      c3    c4     c5     c6
Row_1   100.0   200.0    30.0  50.0  150.0  300.0
Row_2  1000.0  2000.0  3000.0   NaN    NaN    NaN

<font color='#094B91'> In this example we pass list and colimn list for column lable. </font>

In [253]:
pnd.DataFrame(dictList1, columns=['c1', 'c2', 'c6'])

       c1      c2     c6
0   100.0   200.0  300.0
1  1000.0  2000.0    NaN

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we create a dectionary of ndarray or list and than pass this dictionary to dataframe method as argument and also pass a other list for index than that method will convert that dictionary into DataFrame.  </font>

In [254]:
student1 = [ "F2019027004" , "Abdullah" , "Lahore" , 10]
student2 = [ "F2019027044" , "Muzamil" , "FSD", 12]

ndarray2 = { 's1' : student1, 's2' : student2 }

In [255]:
pnd.DataFrame(ndarray2, index=['id', 'name', 'city','class'])

                s1           s2
id     F2019027004  F2019027044
name      Abdullah      Muzamil
city        Lahore          FSD
class           10           12

<font color='#094B91'> In this example we create a list of dectionary  and than pass this list to dataframe method as argument that method will convert that list into DataFrame.  </font>

In [256]:
dictList2 = [{"id" : "F2019027004" , "name" : "Abdullah" , "city" : "Lahore" , "class": 10}, 
             {"id" : "F2019027044" , "name" : "Muzamil" , "class": 12}]

pnd.DataFrame(dictList2)

            id      name    city  class
0  F2019027004  Abdullah  Lahore     10
1  F2019027044   Muzamil     NaN     12

<font color='#094B91'> Now we pass the list and index for index name. </font>

In [257]:
pnd.DataFrame(dictList2, index=['student_1', 'student_2'])

                    id      name    city  class
student_1  F2019027004  Abdullah  Lahore     10
student_2  F2019027044   Muzamil     NaN     12

<font color='#094B91'> In this example we pass list and colimn list for column lable. </font>

In [258]:
pnd.DataFrame(dictList2, columns=['id', 'name', 'city'])

            id      name    city
0  F2019027004  Abdullah  Lahore
1  F2019027044   Muzamil     NaN

# <font color='blue'>11.3 From a list of dicts</font>
<br>

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we create a list of dectionaries and than pass this list to dataframe method as argument that method will convert that list into DataFrame.  </font>

In [259]:
 """constructing data frame from a list of dicts"""
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

<font color='#094B91'> Now we pass the list and index for index lable. </font>

In [260]:
"""passing list of dicts as data and indexes (row labels)"""
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

<font color='#094B91'> In this example we pass list and colimn list for column lable. </font>

In [261]:
"""passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create a list of dectionaries and than pass this list to dataframe method as argument that method will convert that list into DataFrame.  </font>

In [262]:
dictList1 = [{'c1':100, 'c2':200, 'c3':30, 'c4':50, 'c5':150, 'c6':300}, {'c1':1000., 'c2':2000., 'c3':3000.}]

pnd.DataFrame(dictList1)

       c1      c2      c3    c4     c5     c6
0   100.0   200.0    30.0  50.0  150.0  300.0
1  1000.0  2000.0  3000.0   NaN    NaN    NaN

<font color='#094B91'> Now we pass the list and index for index lable. </font>

In [263]:
pnd.DataFrame(dictList1, index=['Row_1', 'Row_2'])

           c1      c2      c3    c4     c5     c6
Row_1   100.0   200.0    30.0  50.0  150.0  300.0
Row_2  1000.0  2000.0  3000.0   NaN    NaN    NaN

<font color='#094B91'> In this example we pass list and colimn list for column lable. </font>

In [264]:
pnd.DataFrame(dictList1, columns=['c1', 'c2', 'c6'])

       c1      c2     c6
0   100.0   200.0  300.0
1  1000.0  2000.0    NaN

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we create a list of dectionaries and than pass this list to dataframe method as argument that method will convert that list into DataFrame.  </font>

In [265]:
dictList2 = [{"id" : "F2019027004" , "name" : "Abdullah" , "city" : "Lahore" , "class": 10}, 
             {"id" : "F2019027044" , "name" : "Muzamil" , "class": 12},
             {"id" : "F2019027001" , "name" : "Abdurrehman" , "city" : "Lahore" , "class": 14}]

pnd.DataFrame(dictList2)

            id         name    city  class
0  F2019027004     Abdullah  Lahore     10
1  F2019027044      Muzamil     NaN     12
2  F2019027001  Abdurrehman  Lahore     14

<font color='#094B91'> Now we pass the list and index for index lable. </font>

In [266]:
pnd.DataFrame(dictList2, index=['Student 1', 'Student 2','Student 3'])

                    id         name    city  class
Student 1  F2019027004     Abdullah  Lahore     10
Student 2  F2019027044      Muzamil     NaN     12
Student 3  F2019027001  Abdurrehman  Lahore     14

<font color='#094B91'> In this example we pass list and colimn list for column lable. </font>

In [267]:
pnd.DataFrame(dictList2, columns=['id', 'name', 'c6'])

            id         name  c6
0  F2019027004     Abdullah NaN
1  F2019027044      Muzamil NaN
2  F2019027001  Abdurrehman NaN

# <font color='blue'>11.4 From a dict of tuples</font>
- You can automatically create a multi-indexed frame by passing a tuples dictionary

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we create dectionaries of tuple and than pass this dectionary to dataframe method as argument that method will convert that dectionary into DataFrame and taht dataframe will be show in example.</font>

In [268]:
 pd.DataFrame({  ('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
                 ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
                 ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
                 ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
                 ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}
              })
#"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create dectionaries of tuple and than pass this dectionary to dataframe method as argument that method will convert that dectionary into DataFrame and taht dataframe will be show in example.</font>

In [269]:
 pnd.DataFrame({ ('d1.1','d2.1'): {('c1.1','c2.1'):100,   ('c1.1','c2.2'):200,   ('c1.1','c2.3'):30}, 
                 ('d1.1','d2.2'): {('c2.1','c2.1'):1000., ('c1.1','c2.2'):2000., ('c1.2','c2.3'):3000.},
                 ('d1.2','d2.3'): {('c2.1','c2.1'):100,   ('c3.1','c2.2'):200,   ('c1.3','c2.3'):50, ('c1.3','c2.4'):150},
                 ('d1.3','d2.1'): {('c3.1','c2.1'):1000., ('c3.1','c2.2'):2000., ('c1.4','c2.3'):3000.},
                 ('d1.2','d2.2'): {('c1.1','c2.1'):100,   ('c2.1','c2.2'):200,   ('c1.4','c2.3'):30, ('c1.3','c2.4'):50}
               })

            d1.1           d1.2    d1.3   d1.2
            d2.1    d2.2   d2.3    d2.1   d2.2
c1.1 c2.1  100.0     NaN    NaN     NaN  100.0
     c2.2  200.0  2000.0    NaN     NaN    NaN
     c2.3   30.0     NaN    NaN     NaN    NaN
c2.1 c2.1    NaN  1000.0  100.0     NaN    NaN
c1.2 c2.3    NaN  3000.0    NaN     NaN    NaN
c3.1 c2.2    NaN     NaN  200.0  2000.0    NaN
c1.3 c2.3    NaN     NaN   50.0     NaN    NaN
     c2.4    NaN     NaN  150.0     NaN   50.0
c3.1 c2.1    NaN     NaN    NaN  1000.0    NaN
c1.4 c2.3    NaN     NaN    NaN  3000.0   30.0
c2.1 c2.2    NaN     NaN    NaN     NaN  200.0

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we create dectionaries of tuple and than pass this dectionary to dataframe method as argument that method will convert that dectionary into DataFrame and taht dataframe will be show in example.</font>

In [270]:
 pnd.DataFrame({ ('ss','cr') :{("id","rol"): "F2019027004" , ("fname","mname") : "Abdullah" , ("class", "stnd1"): 10}, 
                 ('js','cr'):{("did","rol") : "F2019027044" , ("name","mame") : "Muzamil" , ("class", "stnd2"): 12},
                 ('ss','vcr') :{("id","sn") : "F2019027001" , ("fname","mname") : "Abdurrehman" , ("class", "stnd1"): 14}
               })

                      ss           js           ss
                      cr           cr          vcr
id    rol    F2019027004          NaN          NaN
fname mname     Abdullah          NaN  Abdurrehman
class stnd1           10          NaN           14
did   rol            NaN  F2019027044          NaN
name  mame           NaN      Muzamil          NaN
class stnd2          NaN           12          NaN
id    sn             NaN          NaN  F2019027001

# <font color='blue'>11.5 Alternate Constructors</font>

### <font color='green'>1.DataFrame.from_records</font>
- **DataFrame.from_records** takes a list of tuples or an ndarray with structured dtype.
- Works analogously to the normal DataFrame constructor, except that index maybe be a specific field of the structured dtype to use as the
index. 

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we use from_records constructor to create a DataFrame that take parameter for the columns data type  so we pass an ndarray and datatype for the columns.<font>

In [271]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

<font color='#094B91'> Now we make the column C as DataFrame index.<font>

In [272]:
 pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we use from_records constructor to create a DataFrame that take parameter for the columns data type  so we pass an ndarray and datatype for the columns.<font>

In [273]:
array2 = npy.zeros((4,), dtype=[('AB', 'i4'),('CD', 'f2'),('EF', 'a50'),('GH','i2')])
array2

array([(0, 0., b'', 0), (0, 0., b'', 0), (0, 0., b'', 0), (0, 0., b'', 0)],
      dtype=[('AB', '<i4'), ('CD', '<f2'), ('EF', 'S50'), ('GH', '<i2')])

<font color='#094B91'> Now we make the column AB as DataFrame index.<font>

In [274]:
 pnd.DataFrame.from_records(array2 ,index='AB')

     CD   EF  GH
AB
0   0.0  b''   0
0   0.0  b''   0
0   0.0  b''   0
0   0.0  b''   0

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we use from_records constructor to create a DataFrame that take parameter for the columns data type  so we pass an ndarray and datatype for the columns.<font>

In [275]:
array2 =npy.array( [ ("F2019027004" ,  "Abdullah" , "Lahore" , 10), ("F2019027044" , "Muzamil" , "FSD" , 12) ],
          [('id', 'S50'), ('name', 'S50'), ('city', 'S50'), ('class', '<i4')]
        )
array2

array([(b'F2019027004', b'Abdullah', b'Lahore', 10),
       (b'F2019027044', b'Muzamil', b'FSD', 12)],
      dtype=[('id', 'S50'), ('name', 'S50'), ('city', 'S50'), ('class', '<i4')])

<font color='#094B91'> Now we make the column id as DataFrame index.<font>

In [276]:
 pnd.DataFrame.from_records(array2, index='id' )

                       name       city  class
id
b'F2019027004'  b'Abdullah'  b'Lahore'     10
b'F2019027044'   b'Muzamil'     b'FSD'     12


### <font color='green'>2. DataFrame.from_dict</font>

- ***DataFrame.from_dict** takes a dict of dicts or a dict of array-like sequences and returns a **DataFrame**.
- It operates like the DataFrame constructor except for the orient parameter which is 'columns' by default, but which can be set to 'index' in order
to use the dict keys as row labels.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we use from_dict constructor to create a DataFrame that take parameter for the columns data type  so we pass an dictionary of list and datatype for the columns.<font>

In [277]:
 pd.DataFrame.from_dict({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

<font color='#094B91'>If you pass orient='index', the keys will be the row labels. But in this case you must also pass the desired column names: <br>
Now we pass 3 parameters 1 is dictionary, 2 is index, and 3 is column list.<font>

In [278]:
 pd.DataFrame.from_dict({'A': [1, 2, 3], 'B': [4, 5, 6]},
 orient='index', columns=['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      6

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we use from_dict constructor to create a DataFrame that take parameter for the columns data type  so we pass an dictionary of list and datatype for the columns.<font>

In [279]:
 pnd.DataFrame.from_dict({'C1': ['a', 'b', 'c'], 'C2': ['d', 'e', 'f'], 'C3': ['g', 'h', 'i']})

  C1 C2 C3
0  a  d  g
1  b  e  h
2  c  f  i

<font color='#094B91'> Now we pass 3 parameters 1 is dictionary, 2 is index, and 3 is column list.<font>

In [280]:
 pnd.DataFrame.from_dict({'C1': ['a', 'b', 'c'], 'C2': ['d', 'e', 'f'], 'C3': ['g', 'h', 'i']},
 orient='index', columns=['col_1', 'col_2', 'col_3'])

   col_1 col_2 col_3
C1     a     b     c
C2     d     e     f
C3     g     h     i

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we use from_dict constructor to create a DataFrame that take parameter for the columns data type  so we pass an dictionary of list and datatype for the columns.<font>

In [281]:
pnd.DataFrame.from_dict({ 's1': ["F2019027004" ,"Abdullah" ,"Lahore" , 10 ],
                          's2': ["F2019027044" ,"Muzamil" ,"FSD" , 12 ]
                        })

            s1           s2
0  F2019027004  F2019027044
1     Abdullah      Muzamil
2       Lahore          FSD
3           10           12

<font color='#094B91'> Now we pass 3 parameters 1 is dictionary, 2 is index, and 3 is column list.<font>

In [282]:
pnd.DataFrame.from_dict({ 's1': ["F2019027004" ,"Abdullah" ,"Lahore" , 10 ],
                          's2': ["F2019027044" ,"Muzamil" ,"FSD" , 12 ]
                        },
                       orient='index', columns=['ID', 'Name', 'City', 'Class'])

             ID      Name    City  Class
s1  F2019027004  Abdullah  Lahore     10
s2  F2019027044   Muzamil     FSD     12

# <font color='blue'>11.6 Column selection, addition, deletion</font>
- DataFrame can be treated semantically like a dict of like-indexed Series objects. Getting, setting, and deleting columns works with the same
syntax as the analogous dict operations.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we 1st create a dictionary of pandas series and than pass this array to pandas DataFrame method that will creat a dataframe according that dictionary. </font>

In [283]:
 """ A dict is created """
d = {
 'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
 'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
 }
"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it 
 will be sorted list of dict keys"""
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

<font color='#094B91'> Show the dataframe's coloum 'one'. </font>

In [284]:
df['one'] # it is displaying data under coloumn 'one'

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

<font color='#094B91'> Create a new column that's name is 'three' and assign the value by multyply column'one' and column 'two'. </font>

In [285]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation

<font color='#094B91'> Create a new column that's name is 'flag' and assign boolian value by checking the column 'one'. </font>

In [286]:
 df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false

In [287]:
df #print a complete data frame

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

<font color='#094B91'>Delete column 'two' with del key word </font>

In [288]:
del df['two'] #delete a coloumn 'two' from data frame

<font color='#094B91'>Remove column 'three' using pop method </font>

In [289]:
three = df.pop('three') #pop a complete coloumn 'three' from dataframe
three

a    1.0
b    4.0
c    9.0
d    NaN
Name: three, dtype: float64

In [290]:
 df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

<font color='#094B91'>Create a new nolumn name 'foo' and assign a string sclar value 'bar' in each cell. </font>

In [291]:
 df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'

In [292]:
df

   one   flag  foo
a  1.0  False  bar
b  2.0  False  bar
c  3.0   True  bar
d  NaN  False  bar

<font color='#094B91'>Create a new nolumn name 'one_trunc' and assign value from column 'one' (assign value just 1st two rows). </font>

In [293]:
 """following example will take values from coloumn one until give range and will populate the new coloumn"""
df['one_trunc'] = df['one'][:2]

In [294]:
df

   one   flag  foo  one_trunc
a  1.0  False  bar        1.0
b  2.0  False  bar        2.0
c  3.0   True  bar        NaN
d  NaN  False  bar        NaN

<font color='#094B91'>In this example we use insert method By default columns get inserted at the end. The insert function is available to insert at a particular location in the columns. </font>

In [295]:
 """following function has three arguments.
First argument: index where new coloumn will be inserted.
Second argument: label or title of a new coloumn
Third argument: it will create a coloumn copy at specified position"""

df.insert(1, 'bar2', df['one'])

In [296]:
df

   one  bar2   flag  foo  one_trunc
a  1.0   1.0  False  bar        1.0
b  2.0   2.0  False  bar        2.0
c  3.0   3.0   True  bar        NaN
d  NaN   NaN  False  bar        NaN

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we 1st create a dictionary of pandas series and than pass this array to pandas DataFrame method that will creat a dataframe according that dictionary. </font>

In [297]:
dict1 = {
 'Rec_1' : pnd.Series([10, 20, 30], index=['1', '2', '3']),
 'Rec_2' : pnd.Series([100., 200., 300., 400.,500., 600.], index=['1', '2', '3', '4','5','6'])
 }

dataFrame1 = pnd.DataFrame(dict1)
dataFrame1

   Rec_1  Rec_2
1   10.0  100.0
2   20.0  200.0
3   30.0  300.0
4    NaN  400.0
5    NaN  500.0
6    NaN  600.0

<font color='#094B91'> Show the dataframe's coloum 'Rec_1'. </font>

In [298]:
dataFrame1['Rec_1']

1    10.0
2    20.0
3    30.0
4     NaN
5     NaN
6     NaN
Name: Rec_1, dtype: float64

<font color='#094B91'> Create a new column that's name is 'Rec_3' and assign the value by multyply column'Rec_1' and column 'Rec_2'. </font>

In [299]:
dataFrame1['Rec_3'] = dataFrame1['Rec_1'] * dataFrame1['Rec_2']

<font color='#094B91'> Create a new column that's name is 'flg' and assign boolian value by checking the column 'Rec_1'. </font>

In [300]:
 dataFrame1['flg'] = dataFrame1['Rec_1'] > 2

In [301]:
 dataFrame1

   Rec_1  Rec_2   Rec_3    flg
1   10.0  100.0  1000.0   True
2   20.0  200.0  4000.0   True
3   30.0  300.0  9000.0   True
4    NaN  400.0     NaN  False
5    NaN  500.0     NaN  False
6    NaN  600.0     NaN  False

<font color='#094B91'>Delete column 'Rec_1' using del key word. </font>

In [302]:
del dataFrame1['Rec_1']

<font color='#094B91'>Remove column 'Rec_2' using pop method </font>

In [303]:
Rec_2 = dataFrame1.pop('Rec_2')

In [304]:
Rec_2

1    100.0
2    200.0
3    300.0
4    400.0
5    500.0
6    600.0
Name: Rec_2, dtype: float64

In [305]:
dataFrame1

    Rec_3    flg
1  1000.0   True
2  4000.0   True
3  9000.0   True
4     NaN  False
5     NaN  False
6     NaN  False

<font color='#094B91'>Create a new nolumn name 'new' and assign a string sclar value 'new' in each cell (When inserting a scalar value, it will naturally be propagated to fill the column) </font>

In [306]:
dataFrame1['new'] = 'new'

In [307]:
dataFrame1

    Rec_3    flg  new
1  1000.0   True  new
2  4000.0   True  new
3  9000.0   True  new
4     NaN  False  new
5     NaN  False  new
6     NaN  False  new

<font color='#094B91'>In this example we use insert method By default columns get inserted at the end. The insert function is available to insert at a particular location in the columns. </font>

In [308]:
dataFrame1.insert(2, 'Rec_4', dataFrame1['Rec_3'])

In [309]:
dataFrame1

    Rec_3    flg   Rec_4  new
1  1000.0   True  1000.0  new
2  4000.0   True  4000.0  new
3  9000.0   True  9000.0  new
4     NaN  False     NaN  new
5     NaN  False     NaN  new
6     NaN  False     NaN  new

<font color='#094B91'>Create a new nolumn name 'Less than 5' and assign value from column 'Rec_3' (assign value just 1st row). </font>

In [310]:
dataFrame1['Less than 5'] = dataFrame1['Rec_3'][:1]

In [311]:
dataFrame1

    Rec_3    flg   Rec_4  new  Less than 5
1  1000.0   True  1000.0  new       1000.0
2  4000.0   True  4000.0  new          NaN
3  9000.0   True  9000.0  new          NaN
4     NaN  False     NaN  new          NaN
5     NaN  False     NaN  new          NaN
6     NaN  False     NaN  new          NaN

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we 1st create a dictionary of pandas series and than pass this array to pandas DataFrame method that will creat a dataframe according that dictionary. </font>

In [312]:
student1 = {"id" : "F2019027004" , "name" : "Abdullah" , "city" : "Lahore" , "class": 10}
student2 = {"id" : "F2019027044" , "name" : "Muzamil" , "class": 12}

dict2 = {
 'S-1' : pnd.Series(student1),
 'S-2' : pnd.Series(student2)
 }

dataFrame2 = pnd.DataFrame(dict2)
dataFrame2

               S-1          S-2
city        Lahore          NaN
class           10           12
id     F2019027004  F2019027044
name      Abdullah      Muzamil

<font color='#094B91'> Show the dataframe's coloum 'S-1'. </font>

In [313]:
dataFrame2['S-1']

city          Lahore
class             10
id       F2019027004
name        Abdullah
Name: S-1, dtype: object

<font color='#094B91'> Create a new column that's name is 'S-3' and assign the same value by column'S-1'. </font>

In [314]:
dataFrame2['S-3'] = dataFrame2['S-1']

In [315]:
dataFrame2

               S-1          S-2          S-3
city        Lahore          NaN       Lahore
class           10           12           10
id     F2019027004  F2019027044  F2019027004
name      Abdullah      Muzamil     Abdullah

<font color='#094B91'>Delete column 'S-1' using del key word. </font>

In [316]:
del dataFrame2['S-1']

In [317]:
dataFrame2

               S-2          S-3
city           NaN       Lahore
class           12           10
id     F2019027044  F2019027004
name       Muzamil     Abdullah

<font color='#094B91'>Remove column 'S-3' using pop method </font>

In [318]:
S1 = dataFrame2.pop('S-3')

In [319]:
S1

city          Lahore
class             10
id       F2019027004
name        Abdullah
Name: S-3, dtype: object

In [320]:
dataFrame2

               S-2
city           NaN
class           12
id     F2019027044
name       Muzamil

<font color='#094B91'>Create a new nolumn name 'NoN' and assign a string sclar value 'NoN' in each cell (When inserting a scalar value, it will naturally be propagated to fill the column) </font>

In [321]:
dataFrame2['NoN'] = 'NoN'

In [322]:
dataFrame2

               S-2  NoN
city           NaN  NoN
class           12  NoN
id     F2019027044  NoN
name       Muzamil  NoN

<font color='#094B91'>In this example we use insert method By default columns get inserted at the end. The insert function is available to insert at a particular location in the columns. </font>

In [323]:
dataFrame2.insert(2, 'S-4', dataFrame2['S-2'])

In [324]:
dataFrame2

               S-2  NoN          S-4
city           NaN  NoN          NaN
class           12  NoN           12
id     F2019027044  NoN  F2019027044
name       Muzamil  NoN      Muzamil

<font color='#094B91'>Create a new nolumn name 'Less than 1' and assign value from column 'S-2' (assign value just 1st row). </font>

In [325]:
dataFrame2['Less than 1'] = dataFrame2['S-2'][:1]

In [326]:
dataFrame2

               S-2  NoN          S-4 Less than 1
city           NaN  NoN          NaN         NaN
class           12  NoN           12         NaN
id     F2019027044  NoN  F2019027044         NaN
name       Muzamil  NoN      Muzamil         NaN

# <font color='blue'>11.7 Indexing / Selection</font>
- Row selection, for example, returns a Series whose index is the columns of the DataFrame:

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we pass the row name or lable that will show all column lablels and the data of that particular row.<font>

In [327]:
 df.loc['b'] #it will return the coloumn labels and values on row label 'b'

one              2
bar2             2
flag         False
foo            bar
one_trunc        2
Name: b, dtype: object

<font color='#094B91'> In this example we pass the row index number and that will show all column lablels and the data of that particular row.<font>

In [328]:
 df.iloc[2] #it will return the values of those coloumns that is > than 2

one             3
bar2            3
flag         True
foo           bar
one_trunc     NaN
Name: c, dtype: object

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we pass the row name or lable that will show all column lablels and the data of that particular row.<font>

In [329]:
dataFrame1.loc['1']

Rec_3          1000
flg            True
Rec_4          1000
new             new
Less than 5    1000
Name: 1, dtype: object

<font color='#094B91'> In this example we pass the row index number and that will show all column lablels and the data of that particular row.<font>

In [330]:
dataFrame1.iloc[2]

Rec_3          9000
flg            True
Rec_4          9000
new             new
Less than 5     NaN
Name: 3, dtype: object

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we pass the row name or lable that will show all column lablels and the data of that particular row.<font>

In [331]:
dataFrame2.loc['id']

S-2            F2019027044
NoN                    NoN
S-4            F2019027044
Less than 1            NaN
Name: id, dtype: object

<font color='#094B91'> In this example we pass the row index number and that will show all column lablels and the data of that particular row.<font>

In [332]:
dataFrame2.iloc[1]

S-2             12
NoN            NoN
S-4             12
Less than 1    NaN
Name: class, dtype: object

# <font color='blue'>11.8 Data alignment and arithmetic</font>
- Data alignment between DataFrame objects automatically align on both the columns and the index (row labels).
- Again, the resulting object will have the union of the column and row labels.

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we create a DataFrame using numpy randn method  and pass a list for column name.</font>

In [333]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.454414  0.869632  0.629025 -1.563904
1 -0.038653  0.815388 -0.835661  1.870703
2 -0.141952  0.168646 -0.250383  0.091371
3 -0.623582 -0.409516  1.253312  1.748251
4 -0.258193 -0.987086  1.269623 -0.638180
5 -0.216175 -0.498997 -0.907491  0.217602
6  1.087800 -1.234489 -0.987159 -0.115763
7 -1.903823  0.406977 -0.020797 -0.606282
8 -1.271719 -0.021579  0.651784 -0.688203
9 -1.224877  0.543407  1.163915 -0.975982

<font color='#094B91'> In this example we create one more DataFrame using numpy randn method  and pass a list for column name.</font>

In [334]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
df2

          A         B         C
0 -0.316552 -0.162348 -0.793885
1  0.183249  0.303758 -0.352811
2  1.144542 -0.457267  0.261080
3 -1.802497 -1.715060 -0.398883
4 -1.581108  1.177293 -1.424419
5  0.059318  0.816961  1.605450
6  0.254533  1.525032 -0.556702

<font color='#094B91'> Add DataFrame 1 and DataFrame 2</font>

In [335]:
df + df2 # add values of respective coloumn labels

          A         B         C   D
0  0.137862  0.707284 -0.164860 NaN
1  0.144595  1.119146 -1.188472 NaN
2  1.002589 -0.288622  0.010697 NaN
3 -2.426078 -2.124576  0.854429 NaN
4 -1.839300  0.190206 -0.154796 NaN
5 -0.156857  0.317965  0.697960 NaN
6  1.342333  0.290543 -1.543861 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

<font color='#094B91'> When doing an operation between DataFrame and Series, the default behavior is to align the Series index on the DataFrame columns.</font>

In [336]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.493068 -0.054244 -1.464686  3.434608
2 -0.596367 -0.700987 -0.879408  1.655275
3 -1.077996 -1.279148  0.624287  3.312155
4 -0.712607 -1.856719  0.640598  0.925724
5 -0.670590 -1.368629 -1.536516  1.781507
6  0.633385 -2.104121 -1.616184  1.448141
7 -2.358237 -0.462656 -0.649822  0.957622
8 -1.726133 -0.891211  0.022759  0.875701
9 -1.679291 -0.326225  0.534890  0.587922

<font color='#094B91'> Add 5 + 2 in each cell of DataFrame</font>

In [337]:
df * 5 + 2

          A         B         C          D
0  4.272072  6.348161  5.145125  -5.819520
1  1.806733  6.076941 -2.178304  11.353517
2  1.290240  2.843228  0.748087   2.456856
3 -1.117909 -0.047580  8.266560  10.741255
4  0.709037 -2.935432  8.348117  -1.190899
5  0.919124 -0.494983 -2.537453   3.088012
6  7.438998 -4.172446 -2.935795   1.421186
7 -7.519113  4.034883  1.896014  -1.031409
8 -4.358593  1.892106  5.258918  -1.441013
9 -4.124383  4.717033  7.819577  -2.879910

<font color='#094B91'> Each of DataFrame devide by 1</font>

In [338]:
 1 / df

           A          B          C          D
0   2.200634   1.149911   1.589762  -0.639425
1 -25.870975   1.226410  -1.196658   0.534558
2  -7.044631   5.929598  -3.993888  10.944377
3  -1.603639  -2.441907   0.797886   0.572000
4  -3.873077  -1.013083   0.787635  -1.566957
5  -4.625876  -2.004022  -1.101940   4.595536
6   0.919287  -0.810052  -1.013008  -8.638358
7  -0.525259   2.457144 -48.083606  -1.649398
8  -0.786337 -46.341754   1.534252  -1.453060
9  -0.816409   1.840242   0.859169  -1.024609

<font color='#094B91'> Take exponential with each cell of DataFrame</font>

In [339]:
 df ** 4

           A             B             C          D
0   0.042639  5.719293e-01  1.565567e-01   5.981918
1   0.000002  4.420362e-01  4.876635e-01  12.246721
2   0.000406  8.089080e-04  3.930218e-03   0.000070
3   0.151208  2.812443e-02  2.467385e+00   9.341467
4   0.004444  9.493377e-01  2.598361e+00   0.165872
5   0.002184  6.199978e-02  6.782171e-01   0.002242
6   1.400218  2.322465e+00  9.496166e-01   0.000180
7  13.137292  2.743326e-02  1.870733e-07   0.135113
8   2.615556  2.168254e-07  1.804736e-01   0.224319
9   2.250969  8.719665e-02  1.835210e+00   0.907334

<font color='#094B91'> Create a new DataFrame of booluan data type</font>

In [340]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [341]:
df1

       a      b
0   True  False
1  False   True
2   True   True

<font color='#094B91'> Create one more DataFrame of boolian data type</font>

In [342]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [343]:
df2

       a      b
0  False   True
1   True   True
2   True  False

In [344]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [345]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

<font color='#094B91'> Or Operation between two bool type DataFrame</font>

In [346]:
 df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

<font color='#094B91'> Reverce Or Operation between two bool type DataFrame</font>

In [347]:
 -df1

       a      b
0  False   True
1   True  False
2  False  False

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create some tuple and than create a DataFrame using these tuple and pass a list for column name.</font>

In [348]:
tupleNum1 = (100.10, 120.20, 130.30, 140.40, 150.50, 160.60)
tupleNum2 = (210.10, 220.20, 230.30, 240.40, 250.50, 260.60)
tupleNum3 = (300.10, 320.20, 330.30, 340.40, 350.50, 360.60)
tupleNum4 = (410.10, 420.20, 430.30, 440.40, 450.50, 460.60)
tupleNum5 = (500.10, 520.20, 530.30, 540.40, 550.50, 560.60)
tupleNum6 = (610.10, 620.20, 630.30, 640.40, 650.50, 660.60)

dataFrame1 = pnd.DataFrame((tupleNum1,tupleNum2,tupleNum3,tupleNum4,tupleNum5,tupleNum6),
                           columns=['C1', 'C2', 'C3', 'C4','C5','C6'])

In [349]:
dataFrame1

      C1     C2     C3     C4     C5     C6
0  100.1  120.2  130.3  140.4  150.5  160.6
1  210.1  220.2  230.3  240.4  250.5  260.6
2  300.1  320.2  330.3  340.4  350.5  360.6
3  410.1  420.2  430.3  440.4  450.5  460.6
4  500.1  520.2  530.3  540.4  550.5  560.6
5  610.1  620.2  630.3  640.4  650.5  660.6

<font color='#094B91'> In this example we create some more tuple and than create one more DataFrame using these tuple and pass a list for column name.</font>

In [350]:
tupleNum1 = (700.10, 720.20, 730.30, 740.40, 750.50)
tupleNum2 = (810.10, 820.20, 430.30, 840.40, 850.50)
tupleNum3 = (900.10, 920.20, 530.30, 940.40, 950.50)
tupleNum4 = (0.10, 0.20, 0.30, 0.40, 0.50)

dataFrame2 = pnd.DataFrame((tupleNum1,tupleNum2,tupleNum3,tupleNum4), columns=['C1', 'C2', 'C3', 'C4','C6'])

In [351]:
dataFrame2

      C1     C2     C3     C4     C6
0  700.1  720.2  730.3  740.4  750.5
1  810.1  820.2  430.3  840.4  850.5
2  900.1  920.2  530.3  940.4  950.5
3    0.1    0.2    0.3    0.4    0.5

<font color='#094B91'> Add DataFrame 1 and DataFrame 2</font>

In [352]:
dataFrame1 + dataFrame2

       C1      C2     C3      C4  C5      C6
0   800.2   840.4  860.6   880.8 NaN   911.1
1  1020.2  1040.4  660.6  1080.8 NaN  1111.1
2  1200.2  1240.4  860.6  1280.8 NaN  1311.1
3   410.2   420.4  430.6   440.8 NaN   461.1
4     NaN     NaN    NaN     NaN NaN     NaN
5     NaN     NaN    NaN     NaN NaN     NaN

<font color='#094B91'> When doing an operation between DataFrame and Series, the default behavior is to align the Series index on the DataFrame columns.</font>

In [353]:
dataFrame1 * dataFrame2.iloc[1]

          C1         C2         C3         C4  C5        C6
0   81091.01   98588.04   56068.09  117992.16 NaN  136590.3
1  170202.01  180608.04   99098.09  202032.16 NaN  221640.3
2  243111.01  262628.04  142128.09  286072.16 NaN  306690.3
3  332222.01  344648.04  185158.09  370112.16 NaN  391740.3
4  405131.01  426668.04  228188.09  454152.16 NaN  476790.3
5  494242.01  508688.04  271218.09  538192.16 NaN  561840.3

<font color='#094B91'> Add 1 + 4 in each cell of DataFrame</font>

In [354]:
dataFrame1 + 1+ 4 #Add 5 in each row,column and data become allign

      C1     C2     C3     C4     C5     C6
0  105.1  125.2  135.3  145.4  155.5  165.6
1  215.1  225.2  235.3  245.4  255.5  265.6
2  305.1  325.2  335.3  345.4  355.5  365.6
3  415.1  425.2  435.3  445.4  455.5  465.6
4  505.1  525.2  535.3  545.4  555.5  565.6
5  615.1  625.2  635.3  645.4  655.5  665.6

<font color='#094B91'> Add 3 + 4 in each cell of DataFrame</font>

In [355]:
dataFrame2 + 2+ 4 #Add 6 in each row,coulmn and data become allign

      C1     C2     C3     C4     C6
0  706.1  726.2  736.3  746.4  756.5
1  816.1  826.2  436.3  846.4  856.5
2  906.1  926.2  536.3  946.4  956.5
3    6.1    6.2    6.3    6.4    6.5

<font color='#094B91'> devide each cell of DataFrame by 1</font>

In [356]:
1 / dataFrame1

         C1        C2        C3        C4        C5        C6
0  0.009990  0.008319  0.007675  0.007123  0.006645  0.006227
1  0.004760  0.004541  0.004342  0.004160  0.003992  0.003837
2  0.003332  0.003123  0.003028  0.002938  0.002853  0.002773
3  0.002438  0.002380  0.002324  0.002271  0.002220  0.002171
4  0.002000  0.001922  0.001886  0.001850  0.001817  0.001784
5  0.001639  0.001612  0.001587  0.001562  0.001537  0.001514

<font color='#094B91'> devide each cell of DataFrame by 2</font>

In [357]:
2 / dataFrame2

          C1         C2        C3        C4        C6
0   0.002857   0.002777  0.002739  0.002701  0.002665
1   0.002469   0.002438  0.004648  0.002380  0.002352
2   0.002222   0.002173  0.003771  0.002127  0.002104
3  20.000000  10.000000  6.666667  5.000000  4.000000

<font color='#094B91'> Take exponential with each cell of DataFrame</font>

In [358]:
dataFrame1**3

,C1,C2,C3,C4,C5,C6
0,1.003003e+06,1.736654e+06,2.212245e+06,2.767587e+06,3.408863e+06,4.142253e+06
1,9.274236e+06,1.067707e+07,1.221467e+07,1.389324e+07,1.571894e+07,1.769796e+07
2,2.702701e+07,3.282948e+07,3.603510e+07,3.944288e+07,4.305901e+07,4.688967e+07
3,6.897144e+07,7.419389e+07,7.967353e+07,8.541653e+07,9.142909e+07,9.771738e+07
4,1.250750e+08,1.407703e+08,1.491300e+08,1.578142e+08,1.668292e+08,1.761811e+08
5,2.270926e+08,2.385587e+08,2.504044e+08,2.626358e+08,2.752592e+08,2.882808e+08

<font color='#094B91'> Take exponential with each cell of DataFrame</font>

In [359]:
dataFrame2**4

             C1            C2            C3            C4            C6
0  2.402372e+11  2.690373e+11  2.844495e+11  3.005146e+11  3.172508e+11
1  4.306798e+11  4.525630e+11  3.428352e+10  4.988204e+11  5.232356e+11
2  6.563916e+11  7.170161e+11  7.908361e+10  7.820787e+11  8.162224e+11
3  1.000000e-04  1.600000e-03  8.100000e-03  2.560000e-02  6.250000e-02

<font color='#094B91'> Create one DataFrame of boolian data type</font>

In [360]:
boolTuple1 = (1, 1, 1, 1, 0, 0)
boolTuple2 = (1, 0, 0, 1, 0, 1)
boolTuple3 = (0, 0, 1, 1, 0, 0)


dataFrame1 = pnd.DataFrame((boolTuple3,boolTuple3,boolTuple3), columns=['C1', 'C2', 'C3', 'C4','C5','C6'],
                           dtype=bool)

In [361]:
dataFrame1

      C1     C2    C3    C4     C5     C6
0  False  False  True  True  False  False
1  False  False  True  True  False  False
2  False  False  True  True  False  False

<font color='#094B91'> Create one more DataFrame of boolian data type</font>

In [362]:
boolTuple1 = (1,1,1,0,0)
boolTuple2 = (1,0,1,0,1)
boolTuple3 = (0,0,1,1,0)
boolTuple4 = (0,1,0,1,0)

dataFrame2 = pnd.DataFrame((boolTuple1,boolTuple2,boolTuple3,boolTuple4), 
                           columns=['C1', 'C2', 'C3', 'C4','C5'], dtype=bool)

In [363]:
dataFrame2

      C1     C2     C3     C4     C5
0   True   True   True  False  False
1   True  False   True  False   True
2  False  False   True   True  False
3  False   True  False   True  False

<font color='#094B91'> Or Operation between two bool type DataFrame</font>

In [364]:
dataFrame1 | dataFrame2

      C1     C2     C3     C4     C5  C6
0   True   True   True   True  False NaN
1   True  False   True   True   True NaN
2  False  False   True   True  False NaN
3  False  False  False  False  False NaN

<font color='#094B91'> And Operation between two bool type DataFrame</font>

In [365]:
dataFrame1 & dataFrame2

      C1     C2     C3     C4     C5  C6
0  False  False   True  False  False NaN
1  False  False   True  False  False NaN
2  False  False   True   True  False NaN
3  False  False  False  False  False NaN

<font color='#094B91'> Reverce Or Operation between two bool type DataFrame</font>

In [366]:
-dataFrame1

     C1    C2     C3     C4    C5    C6
0  True  True  False  False  True  True
1  True  True  False  False  True  True
2  True  True  False  False  True  True

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we create some tuple and than create a DataFrame using these tuple and pass a list for column name.</font>

In [367]:
S1 = (40.10, 35.20, 36.30, 66.40, 50.50, 60.60)
S2 = (50.10, 50.20, 53.30, 56.40, 65.50, 55.60)
S3 = (60.10, 60.20, 63.30, 74.40, 34.50, 77.60)
S4 = (44.10, 44.20, 43.30, 55.40, 54.50, 88.60)
S5 = (55.10, 55.20, 53.30, 64.40, 54.50, 34.60)
S6 = (66.10, 66.20, 63.30, 68.40, 45.50, 67.60)

dataFrame1 = pnd.DataFrame((S1,S2,S3,S4,S5,S6), columns=['Math', 'Urdu', 'Eng', 'Ch','Isl','Phy'])

In [368]:
dataFrame1

   Math  Urdu   Eng    Ch   Isl   Phy
0  40.1  35.2  36.3  66.4  50.5  60.6
1  50.1  50.2  53.3  56.4  65.5  55.6
2  60.1  60.2  63.3  74.4  34.5  77.6
3  44.1  44.2  43.3  55.4  54.5  88.6
4  55.1  55.2  53.3  64.4  54.5  34.6
5  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we create some more tuple and than create one more DataFrame using these tuple and pass a list for column name.</font>

In [369]:
S1 = (40.10, 35.20, 36.30, 66.40, 50.50)
S2 = (50.10, 50.20, 53.30, 56.40, 65.50)
S3 = (60.10, 60.20, 63.30, 74.40, 34.50)
S4 = (44.10, 44.20, 43.30, 55.40, 54.50)
S5 = (55.10, 55.20, 53.30, 64.40, 54.50)

dataFrame2 = pnd.DataFrame((S1,S2,S3,S4,S5), columns=['Math', 'Urdu', 'Eng','Isl','Phy'])

In [370]:
dataFrame2

   Math  Urdu   Eng   Isl   Phy
0  40.1  35.2  36.3  66.4  50.5
1  50.1  50.2  53.3  56.4  65.5
2  60.1  60.2  63.3  74.4  34.5
3  44.1  44.2  43.3  55.4  54.5
4  55.1  55.2  53.3  64.4  54.5

<font color='#094B91'> Add DataFrame 1 and DataFrame 2</font>

In [371]:
dataFrame1 + dataFrame2

   Ch    Eng    Isl   Math    Phy   Urdu
0 NaN   72.6  116.9   80.2  111.1   70.4
1 NaN  106.6  121.9  100.2  121.1  100.4
2 NaN  126.6  108.9  120.2  112.1  120.4
3 NaN   86.6  109.9   88.2  143.1   88.4
4 NaN  106.6  118.9  110.2   89.1  110.4
5 NaN    NaN    NaN    NaN    NaN    NaN

<font color='#094B91'> When doing an operation between DataFrame and Series, the default behavior is to align the Series index on the DataFrame columns.</font>

In [372]:
dataFrame1 * dataFrame2.iloc[3]

   Ch      Eng     Isl     Math     Phy     Urdu
0 NaN  1571.79  2797.7  1768.41  3302.7  1555.84
1 NaN  2307.89  3628.7  2209.41  3030.2  2218.84
2 NaN  2740.89  1911.3  2650.41  4229.2  2660.84
3 NaN  1874.89  3019.3  1944.81  4828.7  1953.64
4 NaN  2307.89  3019.3  2429.91  1885.7  2439.84
5 NaN  2740.89  2520.7  2915.01  3684.2  2926.04

<font color='#094B91'> Add 3 in each cell of DataFrame</font>

In [373]:
dataFrame1 + 3 #Add 3 in each row,column and data become allign

   Math  Urdu   Eng    Ch   Isl   Phy
0  43.1  38.2  39.3  69.4  53.5  63.6
1  53.1  53.2  56.3  59.4  68.5  58.6
2  63.1  63.2  66.3  77.4  37.5  80.6
3  47.1  47.2  46.3  58.4  57.5  91.6
4  58.1  58.2  56.3  67.4  57.5  37.6
5  69.1  69.2  66.3  71.4  48.5  70.6

<font color='#094B91'> Add 1 + 5 in each cell of DataFrame</font>

In [374]:
dataFrame2 + 1 + 5 #Add 5 in each row,column and data become allign

   Math  Urdu   Eng   Isl   Phy
0  46.1  41.2  42.3  72.4  56.5
1  56.1  56.2  59.3  62.4  71.5
2  66.1  66.2  69.3  80.4  40.5
3  50.1  50.2  49.3  61.4  60.5
4  61.1  61.2  59.3  70.4  60.5

<font color='#094B91'> devide each cell of DataFrame by 2</font>

In [375]:
2 / dataFrame1

       Math      Urdu       Eng        Ch       Isl       Phy
0  0.049875  0.056818  0.055096  0.030120  0.039604  0.033003
1  0.039920  0.039841  0.037523  0.035461  0.030534  0.035971
2  0.033278  0.033223  0.031596  0.026882  0.057971  0.025773
3  0.045351  0.045249  0.046189  0.036101  0.036697  0.022573
4  0.036298  0.036232  0.037523  0.031056  0.036697  0.057803
5  0.030257  0.030211  0.031596  0.029240  0.043956  0.029586

In [376]:
4 / dataFrame2

       Math      Urdu       Eng       Isl       Phy
0  0.099751  0.113636  0.110193  0.060241  0.079208
1  0.079840  0.079681  0.075047  0.070922  0.061069
2  0.066556  0.066445  0.063191  0.053763  0.115942
3  0.090703  0.090498  0.092379  0.072202  0.073394
4  0.072595  0.072464  0.075047  0.062112  0.073394

<font color='#094B91'> Take exponential with each cell of DataFrame</font>

In [377]:
dataFrame1 ** 2

      Math     Urdu      Eng       Ch      Isl      Phy
0  1608.01  1239.04  1317.69  4408.96  2550.25  3672.36
1  2510.01  2520.04  2840.89  3180.96  4290.25  3091.36
2  3612.01  3624.04  4006.89  5535.36  1190.25  6021.76
3  1944.81  1953.64  1874.89  3069.16  2970.25  7849.96
4  3036.01  3047.04  2840.89  4147.36  2970.25  1197.16
5  4369.21  4382.44  4006.89  4678.56  2070.25  4569.76

<font color='#094B91'> Take exponential with each cell of DataFrame</font>

In [378]:
dataFrame2 ** 3

         Math        Urdu         Eng         Isl         Phy
0   64481.201   43614.208   47832.147  292754.944  128787.625
1  125751.501  126506.008  151419.437  179406.144  281011.375
2  217081.801  218167.208  253636.137  411830.784   41063.625
3   85766.121   86350.888   81182.737  170031.464  161878.625
4  167284.151  168196.608  151419.437  267089.984  161878.625

<font color='#094B91'> Create one DataFrame of boolian data type</font>

In [379]:
b1 = (1, 1, 1, 1, 0, 0)
b2 = (1, 0, 0, 1, 0, 1)
b3 = (0, 0, 1, 1, 0, 0)


dataFrame1 = pnd.DataFrame((b1,b2,b3), dtype=bool)

In [380]:
dataFrame1

       0      1      2     3      4      5
0   True   True   True  True  False  False
1   True  False  False  True  False   True
2  False  False   True  True  False  False

<font color='#094B91'> Create one more DataFrame of boolian data type</font>

In [381]:
b1 = (1,1,1,0,0)
b2 = (1,0,1,0,1)


dataFrame2 = pnd.DataFrame((b1,b2), dtype=bool)

In [382]:
dataFrame2

      0      1     2      3      4
0  True   True  True  False  False
1  True  False  True  False   True

<font color='#094B91'> Or Operation between two bool type DataFrame</font>

In [383]:
dataFrame2 | dataFrame1

       0      1      2      3      4   5
0   True   True   True   True  False NaN
1   True  False   True   True   True NaN
2  False  False  False  False  False NaN

<font color='#094B91'> And Operation between two bool type DataFrame</font>

In [384]:
dataFrame2 & dataFrame1

       0      1      2      3      4   5
0   True   True   True  False  False NaN
1   True  False  False  False  False NaN
2  False  False  False  False  False NaN

<font color='#094B91'> Reverce Or Operation between two bool type DataFrame</font>

In [385]:
-dataFrame2

       0      1      2     3      4
0  False  False  False  True   True
1  False   True  False  True  False

# <font color='blue'>11.9 Transposing<font>
- To transpose, access the T attribute (also the transpose function), similar to an ndarray
    
### <font color='orange'>Example 1:</font>
    
<font color='#094B91'> In this example we use transpose property and apply this property on 1st 5 rows.<font>

In [386]:
# only show the first 5 rows
df[:5].T

          0         1         2         3         4
A  0.454414 -0.038653 -0.141952 -0.623582 -0.258193
B  0.869632  0.815388  0.168646 -0.409516 -0.987086
C  0.629025 -0.835661 -0.250383  1.253312  1.269623
D -1.563904  1.870703  0.091371  1.748251 -0.638180

<font color='#094B91'> In this example we Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns.<font>

In [387]:
 dates = pd.date_range('20130101', periods=6)

In [388]:
 dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

<font color='#094B91'> Now we create a DataFrame and make that datetime array as index.<font>

In [389]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [390]:
 df

                   A         B         C         D
2013-01-01  0.078959  1.515880 -1.094380 -0.470318
2013-01-02  0.511631 -0.007997  0.646660 -1.846470
2013-01-03  0.118544  0.269207 -0.122353 -0.210741
2013-01-04 -0.192812  0.110586  1.424446  0.070226
2013-01-05 -0.600865  0.286401 -2.412080 -0.596841
2013-01-06 -1.388959  1.181267  0.322487 -0.007798

<font color='#094B91'> In this example we Creating a DataFrame by passing a dict of objects that can be converted to series.<font>

In [391]:
 df2 = pd.DataFrame({    'A' : 1.,
                         'B' : pd.Timestamp('20130102'),
                         'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                         'D' : np.array([3] * 4,dtype='int32'),
                         'E' : pd.Categorical(["test","train","test","train"]),
                         'F' : 'foo' })

In [392]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

<font color='#094B91'> In this example we use DataFrame property dtypes that will show the all columns data type.<font>

In [393]:
#Having specific dtypes
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we create some touple and than pass these tuple to DataFrame method for creating an DataFrame and that we use transpose property and apply this property on 2 to 4 rows.<font>

In [394]:
tupleNum1 = (100.10, 120.20, 130.30, 140.40, 150.50, 160.60)
tupleNum2 = (210.10, 220.20, 230.30, 240.40, 250.50, 260.60)
tupleNum3 = (300.10, 320.20, 330.30, 340.40, 350.50, 360.60)
tupleNum4 = (410.10, 420.20, 430.30, 440.40, 450.50, 460.60)
tupleNum5 = (500.10, 520.20, 530.30, 540.40, 550.50, 560.60)
tupleNum6 = (610.10, 620.20, 630.30, 640.40, 650.50, 660.60)


dataFrame1 = pnd.DataFrame((tupleNum1,tupleNum2,tupleNum3,tupleNum4,tupleNum5,tupleNum6,),
                           columns=['C1', 'C2', 'C3', 'C4','C5','C6'])

In [395]:
dataFrame1

      C1     C2     C3     C4     C5     C6
0  100.1  120.2  130.3  140.4  150.5  160.6
1  210.1  220.2  230.3  240.4  250.5  260.6
2  300.1  320.2  330.3  340.4  350.5  360.6
3  410.1  420.2  430.3  440.4  450.5  460.6
4  500.1  520.2  530.3  540.4  550.5  560.6
5  610.1  620.2  630.3  640.4  650.5  660.6

In [396]:
dataFrame1[2:4].T

        2      3
C1  300.1  410.1
C2  320.2  420.2
C3  330.3  430.3
C4  340.4  440.4
C5  350.5  450.5
C6  360.6  460.6

<font color='#094B91'> In this example we Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns.<font>

In [397]:
DateArray1 = pnd.date_range('20200101', periods=10)

In [398]:
DateArray1

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

<font color='#094B91'> Now we create a DataFrame and make that datetime array as index.<font>

In [399]:
dataFrame1 = pnd.DataFrame(
    (tupleNum1,tupleNum2,tupleNum3,tupleNum4,tupleNum5,tupleNum6,tupleNum2,tupleNum3,tupleNum4,tupleNum5),
                           index=DateArray1, columns=['C1', 'C2', 'C3', 'C4','C5','C6'])

In [400]:
dataFrame1

               C1     C2     C3     C4     C5     C6
2020-01-01  100.1  120.2  130.3  140.4  150.5  160.6
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6
2020-01-07  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we Creating a DataFrame by passing a dict of objects that can be converted to series.<font>

In [401]:
 dataFrame_1 = pnd.DataFrame({'C1' : 55.,
                             'C2' : pnd.Timestamp('20100102'),
                             'C3' : pnd.Series('Abdullah',index=list(range(10)),dtype='a50'),
                             'C4' : pnd.Series('Shshid',index=list(range(10)),dtype='a50'),
                             'C5' : npy.array([3] * 10,dtype='int32'),
                             'C6' : pnd.Categorical(["odd","even","odd","even","odd","even","odd","even","odd","even"]),
                             'C7' : 'new' })

In [402]:
dataFrame_1

     C1         C2        C3      C4  C5    C6   C7
0  55.0 2010-01-02  Abdullah  Shshid   3   odd  new
1  55.0 2010-01-02  Abdullah  Shshid   3  even  new
2  55.0 2010-01-02  Abdullah  Shshid   3   odd  new
3  55.0 2010-01-02  Abdullah  Shshid   3  even  new
4  55.0 2010-01-02  Abdullah  Shshid   3   odd  new
5  55.0 2010-01-02  Abdullah  Shshid   3  even  new
6  55.0 2010-01-02  Abdullah  Shshid   3   odd  new
7  55.0 2010-01-02  Abdullah  Shshid   3  even  new
8  55.0 2010-01-02  Abdullah  Shshid   3   odd  new
9  55.0 2010-01-02  Abdullah  Shshid   3  even  new

<font color='#094B91'> In this example we use DataFrame property dtypes that will show the all columns data type.<font>

In [403]:
dataFrame_1.dtypes

C1           float64
C2    datetime64[ns]
C3            object
C4            object
C5             int32
C6          category
C7            object
dtype: object

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we create some touple and than pass these tuple to DataFrame method for creating an DataFrame and that we use transpose property and apply this property on 2 to 5 rows.<font>

In [404]:
S1 = (40.10, 35.20, 36.30, 66.40, 50.50, 60.60)
S2 = (50.10, 50.20, 53.30, 56.40, 65.50, 55.60)
S3 = (60.10, 60.20, 63.30, 74.40, 34.50, 77.60)
S4 = (44.10, 44.20, 43.30, 55.40, 54.50, 88.60)
S5 = (55.10, 55.20, 53.30, 64.40, 54.50, 34.60)
S6 = (66.10, 66.20, 63.30, 68.40, 45.50, 67.60)

dataFrame2 = pnd.DataFrame((S1,S2,S3,S4,S5,S6), columns=['Math', 'Urdu', 'Eng', 'Ch','Isl','Phy'])

In [405]:
dataFrame2

   Math  Urdu   Eng    Ch   Isl   Phy
0  40.1  35.2  36.3  66.4  50.5  60.6
1  50.1  50.2  53.3  56.4  65.5  55.6
2  60.1  60.2  63.3  74.4  34.5  77.6
3  44.1  44.2  43.3  55.4  54.5  88.6
4  55.1  55.2  53.3  64.4  54.5  34.6
5  66.1  66.2  63.3  68.4  45.5  67.6

In [406]:
dataFrame2[2:5].T

         2     3     4
Math  60.1  44.1  55.1
Urdu  60.2  44.2  55.2
Eng   63.3  43.3  53.3
Ch    74.4  55.4  64.4
Isl   34.5  54.5  54.5
Phy   77.6  88.6  34.6

<font color='#094B91'> In this example we Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns.<font>

In [407]:
DateArray2 = pnd.date_range('20200201', periods=10)

In [408]:
DateArray2

DatetimeIndex(['2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04',
               '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08',
               '2020-02-09', '2020-02-10'],
              dtype='datetime64[ns]', freq='D')

<font color='#094B91'> Now we create a DataFrame and make that datetime array as index.<font>

In [409]:
dataFrame2 = pnd.DataFrame((S1,S2,S3,S4,S5,S6,S3,S4,S5,S6),
                           index=DateArray2, columns=['Math', 'Urdu', 'Eng', 'Ch','Isl','Phy'])

In [410]:
dataFrame2

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-08  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we Creating a DataFrame by passing a dict of objects that can be converted to series.<font>

In [411]:
 dataFrame_2 = pnd.DataFrame({'Result' : "Pass",
                            'Date' : pnd.Timestamp('20100102'),
                            'First Name' : pnd.Series('First Name',index=list(range(10)),dtype='a50'),
                            'Last Name' : pnd.Series('Last Name',index=list(range(10)),dtype='a50'),
                            'Marks' : npy.array([3] * 10,dtype='int32'),
                            'Position' : pnd.Categorical(["1st","2nd","3rd","1st","2nd","3rd","1st","2nd","3rd","1st"]),
                            'Position' : 'Possition' })

In [412]:
 dataFrame_2

  Result       Date  First Name  Last Name  Marks   Position
0   Pass 2010-01-02  First Name  Last Name      3  Possition
1   Pass 2010-01-02  First Name  Last Name      3  Possition
2   Pass 2010-01-02  First Name  Last Name      3  Possition
3   Pass 2010-01-02  First Name  Last Name      3  Possition
4   Pass 2010-01-02  First Name  Last Name      3  Possition
5   Pass 2010-01-02  First Name  Last Name      3  Possition
6   Pass 2010-01-02  First Name  Last Name      3  Possition
7   Pass 2010-01-02  First Name  Last Name      3  Possition
8   Pass 2010-01-02  First Name  Last Name      3  Possition
9   Pass 2010-01-02  First Name  Last Name      3  Possition

<font color='#094B91'> In this example we use DataFrame property dtypes that will show the all columns data type.<font>

In [413]:
 dataFrame_2.dtypes

Result                object
Date          datetime64[ns]
First Name            object
Last Name             object
Marks                  int32
Position              object
dtype: object


<br>
<br>
<br>
<br>

***

# <center><font size="8" color='red'>12. Viewing Data</font></center>
- We can view data / display data in different ways:
- See the top & bottom rows of the frame
- Selecting a single column
- Selecting via [], which slices the rows
- For getting a cross section using a label
- Selecting on a multi-axis by labe
- Showing label slicing, both endpoints are included
- Reduction in the dimensions of the returned object
- For getting a scalar value
- For getting fast access to a scalar
- Select via the position of the passed integers
- By integer slices, acting similar to numpy/python
- By lists of integer position locations, similar to the numpy/python style
- For slicing rows explicitly
- For slicing columns explicitly
- For getting a value explicitly
- For getting fast access to a scalar
- Using a single column’s values to select data.
- Selecting values from a DataFrame where a boolean condition is met.
- Using the isin() method for filtering

### <font color='orange'>Example 1:</font>

<font color='#094B91'> In this example we can try to view a data frame with different methods. We can use head method that will return tha 1st five rows of a data frame. </font>

In [414]:
 df.head() #display first 5 records

                   A         B         C         D
2013-01-01  0.078959  1.515880 -1.094380 -0.470318
2013-01-02  0.511631 -0.007997  0.646660 -1.846470
2013-01-03  0.118544  0.269207 -0.122353 -0.210741
2013-01-04 -0.192812  0.110586  1.424446  0.070226
2013-01-05 -0.600865  0.286401 -2.412080 -0.596841

<font color='#094B91'> In this example we use tail() method and we pass the '3' as argument that method will return tha last 3 rows of a data frame. </font>

In [415]:
 df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04 -0.192812  0.110586  1.424446  0.070226
2013-01-05 -0.600865  0.286401 -2.412080 -0.596841
2013-01-06 -1.388959  1.181267  0.322487 -0.007798

<font color='#094B91'> In this example we use the dataframe property index that will return all index of the dataframe. </font>

In [416]:
 df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

<font color='#094B91'> In this example we use columns property that will return all columns name of dataframe. </font>

In [417]:
 df.columns #display coloumns

Index(['A', 'B', 'C', 'D'], dtype='object')

<font color='#094B91'> In this example we use values property that will return all values as an array of that dataframe. </font>

In [418]:
 df.values # print values

array([[ 0.07895937,  1.5158796 , -1.09437982, -0.4703181 ],
       [ 0.51163137, -0.00799693,  0.64666026, -1.84647029],
       [ 0.11854361,  0.26920666, -0.12235343, -0.21074112],
       [-0.19281234,  0.1105861 ,  1.42444579,  0.07022572],
       [-0.60086548,  0.28640108, -2.41208024, -0.59684094],
       [-1.38895852,  1.18126712,  0.32248708, -0.00779808]])

<font color='#094B91'> In this example we use Transpose property that will convert the columns into rows and rows convert into columns. </font>

In [419]:
 # Transposing your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.078959    0.511631    0.118544   -0.192812   -0.600865   -1.388959
B    1.515880   -0.007997    0.269207    0.110586    0.286401    1.181267
C   -1.094380    0.646660   -0.122353    1.424446   -2.412080    0.322487
D   -0.470318   -1.846470   -0.210741    0.070226   -0.596841   -0.007798

<font color='#094B91'> In this example we use a method sort_index that will sort all data according the index. </font>

In [420]:
 #Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.470318 -1.094380  1.515880  0.078959
2013-01-02 -1.846470  0.646660 -0.007997  0.511631
2013-01-03 -0.210741 -0.122353  0.269207  0.118544
2013-01-04  0.070226  1.424446  0.110586 -0.192812
2013-01-05 -0.596841 -2.412080  0.286401 -0.600865
2013-01-06 -0.007798  0.322487  1.181267 -1.388959

<font color='#094B91'> In this example we use a method sort_values that will sort all data according the values. </font>

In [421]:
 #Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  0.511631 -0.007997  0.646660 -1.846470
2013-01-04 -0.192812  0.110586  1.424446  0.070226
2013-01-03  0.118544  0.269207 -0.122353 -0.210741
2013-01-05 -0.600865  0.286401 -2.412080 -0.596841
2013-01-06 -1.388959  1.181267  0.322487 -0.007798
2013-01-01  0.078959  1.515880 -1.094380 -0.470318

<font color='#094B91'> In this example we use a method describe() that will show the statistic summary or dataframe. </font>

In [422]:
# Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.245584  0.559224 -0.205870 -0.510324
std    0.670464  0.629871  1.365847  0.703377
min   -1.388959 -0.007997 -2.412080 -1.846470
25%   -0.498852  0.150241 -0.851373 -0.565210
50%   -0.056926  0.277804  0.100067 -0.340530
75%    0.108648  0.957551  0.565617 -0.058534
max    0.511631  1.515880  1.424446  0.070226

<font color='#094B91'> In this example we pass a column name that will return tha that specific column as a pandas series. </font>

In [423]:
 #Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2013-01-01    0.078959
2013-01-02    0.511631
2013-01-03    0.118544
2013-01-04   -0.192812
2013-01-05   -0.600865
2013-01-06   -1.388959
Freq: D, Name: A, dtype: float64

<font color='#094B91'> In this example we show some specific columns using colon : . </font>

In [424]:
#Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01  0.078959  1.515880 -1.094380 -0.470318
2013-01-02  0.511631 -0.007997  0.646660 -1.846470
2013-01-03  0.118544  0.269207 -0.122353 -0.210741

<font color='#094B91'> In this example we show some specific data between a specific date. </font>

In [425]:
 df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.511631 -0.007997  0.646660 -1.846470
2013-01-03  0.118544  0.269207 -0.122353 -0.210741
2013-01-04 -0.192812  0.110586  1.424446  0.070226

<font color='#094B91'> In this example we show some specific data between a range and we show specific columns. </font>

In [426]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.078959  1.515880
2013-01-02  0.511631 -0.007997
2013-01-03  0.118544  0.269207
2013-01-04 -0.192812  0.110586
2013-01-05 -0.600865  0.286401
2013-01-06 -1.388959  1.181267

<font color='#094B91'> In this example we show some specific data between a specific dat and we show just two columns. </font>

In [427]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.511631 -0.007997
2013-01-03  0.118544  0.269207
2013-01-04 -0.192812  0.110586

<font color='#094B91'> In this example we get a specific row by it's index name and we just show two columns of that specific row. </font>

In [428]:
# Reduction in the dimensions of the returned object
df.loc['20130102',['A','B']]

A    0.511631
B   -0.007997
Name: 2013-01-02 00:00:00, dtype: float64

<font color='#094B91'> In this example we get a specific row by it's index numner and we just show one column of that specific row. </font>

In [429]:
 # For getting a scalar value
df.loc[dates[0],'A']

0.07895937177152129

<font color='#094B91'> In this example we get a specific row by it's index numner and we just show one column of that specific row. </font>

In [430]:
 # For getting fast access to a scalar 
df.at[dates[0],'A']

0.07895937177152129

<font color='#094B91'> In this example we get specific row but that will show as column. </font>

In [431]:
 # Select via the position of the passed integers
df.iloc[3]

A   -0.192812
B    0.110586
C    1.424446
D    0.070226
Name: 2013-01-04 00:00:00, dtype: float64

<font color='#094B91'> In this example we get some rows and columns by slices. </font>

In [432]:
 # By integer slices, acting similar to numpy/python
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.192812  0.110586
2013-01-05 -0.600865  0.286401

<font color='#094B91'> In this example we get a specific row and columns by it's index numner  </font>

In [433]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.511631  0.646660
2013-01-03  0.118544 -0.122353
2013-01-05 -0.600865 -2.412080

<font color='#094B91'> In this example we get some rows and columns by slices. </font>

In [434]:
 # For slicing rows explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01  1.515880 -1.094380
2013-01-02 -0.007997  0.646660
2013-01-03  0.269207 -0.122353
2013-01-04  0.110586  1.424446
2013-01-05  0.286401 -2.412080
2013-01-06  1.181267  0.322487

<font color='#094B91'> In this example we get a single sell. </font>

In [435]:
 # For getting a value explicitly
df.iloc[1,1]

-0.007996933867974754

<font color='#094B91'> In this example we get all data where column A's data is graterthan 0. </font>

In [436]:
 # Using a single column’s values to select data.
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.078959  1.515880 -1.094380 -0.470318
2013-01-02  0.511631 -0.007997  0.646660 -1.846470
2013-01-03  0.118544  0.269207 -0.122353 -0.210741

<font color='#094B91'> In this example we get all data graterthan 0. </font>

In [437]:
 # Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01  0.078959  1.515880       NaN       NaN
2013-01-02  0.511631       NaN  0.646660       NaN
2013-01-03  0.118544  0.269207       NaN       NaN
2013-01-04       NaN  0.110586  1.424446  0.070226
2013-01-05       NaN  0.286401       NaN       NaN
2013-01-06       NaN  1.181267  0.322487       NaN

<font color='#094B91'> In this example we copy dataframe into other variable. </font>

In [438]:
# Using the isin() method for filtering:
df2 = df.copy()

<font color='#094B91'> In this example we a column with some values. </font>

In [439]:
 df2['E'] = ['one', 'one','two','three','four','three']

In [440]:
 df2

                   A         B         C         D      E
2013-01-01  0.078959  1.515880 -1.094380 -0.470318    one
2013-01-02  0.511631 -0.007997  0.646660 -1.846470    one
2013-01-03  0.118544  0.269207 -0.122353 -0.210741    two
2013-01-04 -0.192812  0.110586  1.424446  0.070226  three
2013-01-05 -0.600865  0.286401 -2.412080 -0.596841   four
2013-01-06 -1.388959  1.181267  0.322487 -0.007798  three

<font color='#094B91'> In this example we check that a specific vale is prasent in some specific column. </font>

In [441]:
 df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.118544  0.269207 -0.122353 -0.210741   two
2013-01-05 -0.600865  0.286401 -2.412080 -0.596841  four

### <font color='orange'>Example 2:</font>

<font color='#094B91'> In this example we can try to view a data frame with different methods. We can use head method that will return tha 1st five rows of a data frame. </font>

In [442]:
dataFrame1.head()

               C1     C2     C3     C4     C5     C6
2020-01-01  100.1  120.2  130.3  140.4  150.5  160.6
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we use tail() method and we pass the '4' as argument that method will return tha last 3 rows of a data frame. </font>

In [443]:
dataFrame1.tail(4)

               C1     C2     C3     C4     C5     C6
2020-01-07  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we use the dataframe property index that will return all index of the dataframe. </font>

In [444]:
dataFrame1.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

<font color='#094B91'> In this example we use columns property that will return all columns name of dataframe. </font>

In [445]:
dataFrame1.columns

Index(['C1', 'C2', 'C3', 'C4', 'C5', 'C6'], dtype='object')

<font color='#094B91'> In this example we use values property that will return all values as an array of that dataframe. </font>

In [446]:
dataFrame1.values

array([[100.1, 120.2, 130.3, 140.4, 150.5, 160.6],
       [210.1, 220.2, 230.3, 240.4, 250.5, 260.6],
       [300.1, 320.2, 330.3, 340.4, 350.5, 360.6],
       [410.1, 420.2, 430.3, 440.4, 450.5, 460.6],
       [500.1, 520.2, 530.3, 540.4, 550.5, 560.6],
       [610.1, 620.2, 630.3, 640.4, 650.5, 660.6],
       [210.1, 220.2, 230.3, 240.4, 250.5, 260.6],
       [300.1, 320.2, 330.3, 340.4, 350.5, 360.6],
       [410.1, 420.2, 430.3, 440.4, 450.5, 460.6],
       [500.1, 520.2, 530.3, 540.4, 550.5, 560.6]])

<font color='#094B91'> In this example we use Transpose property that will convert the columns into rows and rows convert into columns. </font>

In [447]:
 # Transposing your data
dataFrame1.T

,2020-01-01,2020-01-02,2020-01-03,2020-01-04,2020-01-05,2020-01-06,2020-01-07,2020-01-08,2020-01-09,2020-01-10
C1,100.1,210.1,300.1,410.1,500.1,610.1,210.1,300.1,410.1,500.1
C2,120.2,220.2,320.2,420.2,520.2,620.2,220.2,320.2,420.2,520.2
C3,130.3,230.3,330.3,430.3,530.3,630.3,230.3,330.3,430.3,530.3
C4,140.4,240.4,340.4,440.4,540.4,640.4,240.4,340.4,440.4,540.4
C5,150.5,250.5,350.5,450.5,550.5,650.5,250.5,350.5,450.5,550.5
C6,160.6,260.6,360.6,460.6,560.6,660.6,260.6,360.6,460.6,560.6

<font color='#094B91'> In this example we use a method sort_index that will sort all data according the index. </font>

In [448]:
 #Sorting by an axis
dataFrame1.sort_index(axis=0,ascending=True)

               C1     C2     C3     C4     C5     C6
2020-01-01  100.1  120.2  130.3  140.4  150.5  160.6
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6
2020-01-07  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we use a method sort_values that will sort all data according the values. </font>

In [449]:
 #Sorting by values
dataFrame1.sort_values(by='C6')

               C1     C2     C3     C4     C5     C6
2020-01-01  100.1  120.2  130.3  140.4  150.5  160.6
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-07  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6

<font color='#094B91'> In this example we use a method describe() that will show the statistic summary or dataframe. </font>

In [450]:
# Describe shows a quick statistic summary of your data
dataFrame1.describe()

              C1          C2          C3          C4          C5          C6
count   10.00000   10.000000   10.000000   10.000000   10.000000   10.000000
mean   355.10000  370.200000  380.300000  390.400000  400.500000  410.600000
std    158.55248  158.113883  158.113883  158.113883  158.113883  158.113883
min    100.10000  120.200000  130.300000  140.400000  150.500000  160.600000
25%    232.60000  245.200000  255.300000  265.400000  275.500000  285.600000
50%    355.10000  370.200000  380.300000  390.400000  400.500000  410.600000
75%    477.60000  495.200000  505.300000  515.400000  525.500000  535.600000
max    610.10000  620.200000  630.300000  640.400000  650.500000  660.600000

<font color='#094B91'> In this example we pass a column name that will return tha that specific column as a pandas series. </font>

In [451]:
#Selecting a single column, which yields a Series, equivalent to df.A

dataFrame1['C1']

2020-01-01    100.1
2020-01-02    210.1
2020-01-03    300.1
2020-01-04    410.1
2020-01-05    500.1
2020-01-06    610.1
2020-01-07    210.1
2020-01-08    300.1
2020-01-09    410.1
2020-01-10    500.1
Freq: D, Name: C1, dtype: float64

<font color='#094B91'> In this example we show some specific columns using colon : or slices technique . </font>

In [452]:
#Selecting via [], which slices the rows.
dataFrame1[1:4]

               C1     C2     C3     C4     C5     C6
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6

- Make 'C2' as Index

In [453]:
dataFrame1 = dataFrame1.from_records(dataFrame1, index=DateArray1)

In [454]:
dataFrame1.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

In [455]:
dataFrame1

               C1     C2     C3     C4     C5     C6
2020-01-01  100.1  120.2  130.3  140.4  150.5  160.6
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6
2020-01-07  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we show some specific data between a specific date. </font>

In [456]:
dataFrame1['20200104':'20200106']

               C1     C2     C3     C4     C5     C6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6

<font color='#094B91'> In this example we show some specific data between a range and we show specific columns. </font>
- .loc[] => in this example this method take 2 parameter 1 is range and 2nd is columns

In [457]:
#Selecting on a multi-axis by label

dataFrame1.loc[:,['C1','C4']]

               C1     C4
2020-01-01  100.1  140.4
2020-01-02  210.1  240.4
2020-01-03  300.1  340.4
2020-01-04  410.1  440.4
2020-01-05  500.1  540.4
2020-01-06  610.1  640.4
2020-01-07  210.1  240.4
2020-01-08  300.1  340.4
2020-01-09  410.1  440.4
2020-01-10  500.1  540.4

In [458]:
dataFrame1.columns

Index(['C1', 'C2', 'C3', 'C4', 'C5', 'C6'], dtype='object')

<font color='#094B91'> In this example we show some specific data between a range and we show specific columns. </font>

In [459]:
#Showing label slicing, both endpoints are included

dataFrame1.loc['20200102':'20200104',['C1','C4']]

               C1     C4
2020-01-02  210.1  240.4
2020-01-03  300.1  340.4
2020-01-04  410.1  440.4

<font color='#094B91'> In this example we show some specific data between a specific dat and we show just two columns. </font>

In [460]:
dataFrame1.loc['20200102',['C1','C4']]

C1    210.1
C4    240.4
Name: 2020-01-02 00:00:00, dtype: float64

<font color='#094B91'> In this example we get a specific row by it's index name and we just show one column of that specific row. </font>

In [461]:
 # For getting a scalar value

dataFrame1.loc[DateArray1[0],'C1']

100.1

<font color='#094B91'> In this example we get a specific row by it's index numner and we just show one column of that specific row. </font>

In [462]:
 # For getting fast access to a scalar 

dataFrame1.at[DateArray1[0],'C3']

130.3

<font color='#094B91'> In this example we get specific row but that will show as column. </font>

In [463]:
 # Select via the position of the passed integers

dataFrame1.iloc[5]

C1    610.1
C2    620.2
C3    630.3
C4    640.4
C5    650.5
C6    660.6
Name: 2020-01-06 00:00:00, dtype: float64

<font color='#094B91'> In this example we get some rows and columns by slices. </font>

In [464]:
 # By integer slices, acting similar to numpy/python

dataFrame1.iloc[2:5,0:3]

               C1     C2     C3
2020-01-03  300.1  320.2  330.3
2020-01-04  410.1  420.2  430.3
2020-01-05  500.1  520.2  530.3

<font color='#094B91'> In this example we get a specific row and columns by it's index numner  </font>

In [465]:
# By lists of integer position locations, similar to the numpy/python style

dataFrame1.iloc[[2,4,6],[0,3]]

               C1     C4
2020-01-03  300.1  340.4
2020-01-05  500.1  540.4
2020-01-07  210.1  240.4

<font color='#094B91'> In this example we get some rows and columns by slices. </font>

In [466]:
 # For slicing rows explicitly

dataFrame1.iloc[:,1:4]

               C2     C3     C4
2020-01-01  120.2  130.3  140.4
2020-01-02  220.2  230.3  240.4
2020-01-03  320.2  330.3  340.4
2020-01-04  420.2  430.3  440.4
2020-01-05  520.2  530.3  540.4
2020-01-06  620.2  630.3  640.4
2020-01-07  220.2  230.3  240.4
2020-01-08  320.2  330.3  340.4
2020-01-09  420.2  430.3  440.4
2020-01-10  520.2  530.3  540.4

<font color='#094B91'> In this example we get a single sell. </font>

In [467]:
 # For getting a value explicitly

dataFrame1.iloc[1,2]

230.3

<font color='#094B91'> In this example we get all data where column C1's data is graterthan '2020-01-07'. </font>

In [468]:
# Using a single column’s values to select data.

dataFrame1[dataFrame1.index > '2020-01-07']

               C1     C2     C3     C4     C5     C6
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we get all data graterthan 300'. </font>

In [469]:
# Selecting values from a DataFrame where a boolean condition is met.

dataFrame1[dataFrame1 > 300]

               C1     C2     C3     C4     C5     C6
2020-01-01    NaN    NaN    NaN    NaN    NaN    NaN
2020-01-02    NaN    NaN    NaN    NaN    NaN    NaN
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6
2020-01-07    NaN    NaN    NaN    NaN    NaN    NaN
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we copy dataframe into other variable. </font>

In [470]:
# Using the isin() method for filtering:

dataFrame11 = dataFrame1.copy()

In [471]:
dataFrame11

               C1     C2     C3     C4     C5     C6
2020-01-01  100.1  120.2  130.3  140.4  150.5  160.6
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6
2020-01-07  210.1  220.2  230.3  240.4  250.5  260.6
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6

<font color='#094B91'> In this example we add a column with some values. </font>

In [472]:
 dataFrame1['C7'] = [10,22,33,44,55,66,77,88,41,33]

In [473]:
dataFrame1

               C1     C2     C3     C4     C5     C6  C7
2020-01-01  100.1  120.2  130.3  140.4  150.5  160.6  10
2020-01-02  210.1  220.2  230.3  240.4  250.5  260.6  22
2020-01-03  300.1  320.2  330.3  340.4  350.5  360.6  33
2020-01-04  410.1  420.2  430.3  440.4  450.5  460.6  44
2020-01-05  500.1  520.2  530.3  540.4  550.5  560.6  55
2020-01-06  610.1  620.2  630.3  640.4  650.5  660.6  66
2020-01-07  210.1  220.2  230.3  240.4  250.5  260.6  77
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6  88
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6  41
2020-01-10  500.1  520.2  530.3  540.4  550.5  560.6  33

<font color='#094B91'> In this example we check that a specific vale is prasent in some specific column. </font>

In [474]:
dataFrame1[dataFrame1['C7'].isin([41, 88])]

               C1     C2     C3     C4     C5     C6  C7
2020-01-08  300.1  320.2  330.3  340.4  350.5  360.6  88
2020-01-09  410.1  420.2  430.3  440.4  450.5  460.6  41

### <font color='orange'>Example 3:</font>

<font color='#094B91'> In this example we can try to view a data frame with different methods. We can use head method that will return tha 1st five rows of a data frame. </font>

In [475]:
dataFrame2.head()

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6

<font color='#094B91'> In this example we use tail() method and we pass the '5' as argument that method will return tha last 3 rows of a data frame. </font>

In [476]:
dataFrame2.tail(5)

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-08  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we use the dataframe property index that will return all index of the dataframe. </font>

In [477]:
dataFrame2.index

DatetimeIndex(['2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04',
               '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08',
               '2020-02-09', '2020-02-10'],
              dtype='datetime64[ns]', freq='D')

<font color='#094B91'> In this example we use columns property that will return all columns name of dataframe. </font>

In [478]:
dataFrame2.columns

Index(['Math', 'Urdu', 'Eng', 'Ch', 'Isl', 'Phy'], dtype='object')

<font color='#094B91'> In this example we use values property that will return all values as an array of that dataframe. </font>

In [479]:
dataFrame2.values

array([[40.1, 35.2, 36.3, 66.4, 50.5, 60.6],
       [50.1, 50.2, 53.3, 56.4, 65.5, 55.6],
       [60.1, 60.2, 63.3, 74.4, 34.5, 77.6],
       [44.1, 44.2, 43.3, 55.4, 54.5, 88.6],
       [55.1, 55.2, 53.3, 64.4, 54.5, 34.6],
       [66.1, 66.2, 63.3, 68.4, 45.5, 67.6],
       [60.1, 60.2, 63.3, 74.4, 34.5, 77.6],
       [44.1, 44.2, 43.3, 55.4, 54.5, 88.6],
       [55.1, 55.2, 53.3, 64.4, 54.5, 34.6],
       [66.1, 66.2, 63.3, 68.4, 45.5, 67.6]])

<font color='#094B91'> In this example we use Transpose property that will convert the columns into rows and rows convert into columns. </font>

In [480]:
 # Transposing your dat
dataFrame2.T

,2020-02-01,2020-02-02,2020-02-03,2020-02-04,2020-02-05,2020-02-06,2020-02-07,2020-02-08,2020-02-09,2020-02-10
Math,40.1,50.1,60.1,44.1,55.1,66.1,60.1,44.1,55.1,66.1
Urdu,35.2,50.2,60.2,44.2,55.2,66.2,60.2,44.2,55.2,66.2
Eng,36.3,53.3,63.3,43.3,53.3,63.3,63.3,43.3,53.3,63.3
Ch,66.4,56.4,74.4,55.4,64.4,68.4,74.4,55.4,64.4,68.4
Isl,50.5,65.5,34.5,54.5,54.5,45.5,34.5,54.5,54.5,45.5
Phy,60.6,55.6,77.6,88.6,34.6,67.6,77.6,88.6,34.6,67.6

<font color='#094B91'> In this example we use a method sort_index that will sort all data according the index. </font>

In [481]:
 #Sorting by an axis
dataFrame2.sort_index(axis=0,ascending=False)

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-08  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6

<font color='#094B91'> In this example we use a method sort_values that will sort all data according the values. </font>

In [482]:
 #Sorting by values
dataFrame2.sort_values(by='Math')

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-08  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we use a method describe() that will show the statistic summary or dataframe. </font>

In [483]:
# Describe shows a quick statistic summary of your data
dataFrame2.describe()

            Math       Urdu        Eng         Ch       Isl        Phy
count  10.000000  10.000000  10.000000  10.000000  10.00000  10.000000
mean   54.100000  53.700000  53.600000  64.800000  49.40000  65.300000
std     9.273618  10.200762   9.933669   7.152311   9.65459  19.436792
min    40.100000  35.200000  36.300000  55.400000  34.50000  34.600000
25%    45.600000  45.700000  45.800000  58.400000  45.50000  56.850000
50%    55.100000  55.200000  53.300000  65.400000  52.50000  67.600000
75%    60.100000  60.200000  63.300000  68.400000  54.50000  77.600000
max    66.100000  66.200000  63.300000  74.400000  65.50000  88.600000

<font color='#094B91'> In this example we pass a column name that will return tha that specific column as a pandas series. </font>

In [484]:
#Selecting a single column, which yields a Series, equivalent to df.A

dataFrame2['Math']

2020-02-01    40.1
2020-02-02    50.1
2020-02-03    60.1
2020-02-04    44.1
2020-02-05    55.1
2020-02-06    66.1
2020-02-07    60.1
2020-02-08    44.1
2020-02-09    55.1
2020-02-10    66.1
Freq: D, Name: Math, dtype: float64

<font color='#094B91'> In this example we show some specific columns using colon : (slices). </font>

In [485]:
#Selecting via [], which slices the rows.

dataFrame2[2:7]

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6

- add an index coulmn

In [486]:
dataFrame2 = dataFrame2.from_records(dataFrame2, index=DateArray2)

In [487]:
dataFrame2.index

DatetimeIndex(['2020-02-01', '2020-02-02', '2020-02-03', '2020-02-04',
               '2020-02-05', '2020-02-06', '2020-02-07', '2020-02-08',
               '2020-02-09', '2020-02-10'],
              dtype='datetime64[ns]', freq='D')

In [488]:
dataFrame2

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-08  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we show some specific data between a specific date. </font>

In [489]:
dataFrame2['20200201':'20200206']

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we show some specific data between a range and we show specific columns. </font>

In [490]:
#Selecting on a multi-axis by label

dataFrame2.loc[:,['Math','Eng']]

            Math   Eng
2020-02-01  40.1  36.3
2020-02-02  50.1  53.3
2020-02-03  60.1  63.3
2020-02-04  44.1  43.3
2020-02-05  55.1  53.3
2020-02-06  66.1  63.3
2020-02-07  60.1  63.3
2020-02-08  44.1  43.3
2020-02-09  55.1  53.3
2020-02-10  66.1  63.3

<font color='#094B91'> In this example we show some specific data between a specific dat and we show just two columns. </font>

In [491]:
#Showing label slicing, both endpoints are included

dataFrame2.loc['20200201':'20200206',['Math','Eng']]

            Math   Eng
2020-02-01  40.1  36.3
2020-02-02  50.1  53.3
2020-02-03  60.1  63.3
2020-02-04  44.1  43.3
2020-02-05  55.1  53.3
2020-02-06  66.1  63.3

<font color='#094B91'> In this example we get a specific row by it's index name and we just show two columns of that specific row. </font>

In [492]:
# Reduction in the dimensions of the returned object

dataFrame2.loc['20200206',['Math','Eng']]

Math    66.1
Eng     63.3
Name: 2020-02-06 00:00:00, dtype: float64

<font color='#094B91'> In this example we get a specific row by it's index numner and we just show one column of that specific row. </font>

In [493]:
 # For getting a scalar value

dataFrame2.loc[DateArray2[4],'Math']

55.1

<font color='#094B91'> In this example we get a specific row by it's index numner and we just show one column of that specific row. </font>

In [494]:
 # For getting fast access to a scalar 

dataFrame2.at[DateArray2[6],'Math']

60.1

<font color='#094B91'> In this example we get specific row but that will show as column. </font>

In [495]:
 # Select via the position of the passed integers

dataFrame2.iloc[5]

Math    66.1
Urdu    66.2
Eng     63.3
Ch      68.4
Isl     45.5
Phy     67.6
Name: 2020-02-06 00:00:00, dtype: float64

<font color='#094B91'> In this example we get some rows and columns by slices. </font>

In [496]:
 # By integer slices, acting similar to numpy/python

dataFrame2.iloc[2:5,0:3]

            Math  Urdu   Eng
2020-02-03  60.1  60.2  63.3
2020-02-04  44.1  44.2  43.3
2020-02-05  55.1  55.2  53.3

<font color='#094B91'> In this example we get a specific row and columns by it's index numner  </font>

In [497]:
# By lists of integer position locations, similar to the numpy/python style

dataFrame2.iloc[[2,4,6],[0,3]]

            Math    Ch
2020-02-03  60.1  74.4
2020-02-05  55.1  64.4
2020-02-07  60.1  74.4

<font color='#094B91'> In this example we get some rows and columns by slices. </font>

In [498]:
 # For slicing rows explicitly

dataFrame2.iloc[:,1:4]

            Urdu   Eng    Ch
2020-02-01  35.2  36.3  66.4
2020-02-02  50.2  53.3  56.4
2020-02-03  60.2  63.3  74.4
2020-02-04  44.2  43.3  55.4
2020-02-05  55.2  53.3  64.4
2020-02-06  66.2  63.3  68.4
2020-02-07  60.2  63.3  74.4
2020-02-08  44.2  43.3  55.4
2020-02-09  55.2  53.3  64.4
2020-02-10  66.2  63.3  68.4

<font color='#094B91'> In this example we get a single cell. </font>

In [499]:
 # For getting a value explicitly

dataFrame2.iloc[1,4]

65.5

<font color='#094B91'> In this example we get all data where column Urdu 's data is graterthan 60. </font>

In [500]:
# Using a single column’s values to select data.

dataFrame2[dataFrame2.Urdu > 60]

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we get all data graterthan 0. </font>

In [501]:
# Selecting values from a DataFrame where a boolean condition is met.

dataFrame2[dataFrame2 > 60]

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-01   NaN   NaN   NaN  66.4   NaN  60.6
2020-02-02   NaN   NaN   NaN   NaN  65.5   NaN
2020-02-03  60.1  60.2  63.3  74.4   NaN  77.6
2020-02-04   NaN   NaN   NaN   NaN   NaN  88.6
2020-02-05   NaN   NaN   NaN  64.4   NaN   NaN
2020-02-06  66.1  66.2  63.3  68.4   NaN  67.6
2020-02-07  60.1  60.2  63.3  74.4   NaN  77.6
2020-02-08   NaN   NaN   NaN   NaN   NaN  88.6
2020-02-09   NaN   NaN   NaN  64.4   NaN   NaN
2020-02-10  66.1  66.2  63.3  68.4   NaN  67.6

<font color='#094B91'> In this example we copy dataframe into other variable. </fon

In [502]:
# Using the isin() method for filtering:

dataFrame22 = dataFrame2.copy()

In [503]:
dataFrame22

            Math  Urdu   Eng    Ch   Isl   Phy
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6
2020-02-08  44.1  44.2  43.3  55.4  54.5  88.6
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6

<font color='#094B91'> In this example we a column with some values. </font>

In [504]:
 dataFrame22['bio'] = [66,56,75,67,48,88,24,44,55,55]

In [505]:
dataFrame22

            Math  Urdu   Eng    Ch   Isl   Phy  bio
2020-02-01  40.1  35.2  36.3  66.4  50.5  60.6   66
2020-02-02  50.1  50.2  53.3  56.4  65.5  55.6   56
2020-02-03  60.1  60.2  63.3  74.4  34.5  77.6   75
2020-02-04  44.1  44.2  43.3  55.4  54.5  88.6   67
2020-02-05  55.1  55.2  53.3  64.4  54.5  34.6   48
2020-02-06  66.1  66.2  63.3  68.4  45.5  67.6   88
2020-02-07  60.1  60.2  63.3  74.4  34.5  77.6   24
2020-02-08  44.1  44.2  43.3  55.4  54.5  88.6   44
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6   55
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6   55

<font color='#094B91'> In this example we check that a specific vale is prasent in some specific column. </font>

In [506]:
dataFrame22[dataFrame22['bio'].isin([77,55])]

            Math  Urdu   Eng    Ch   Isl   Phy  bio
2020-02-09  55.1  55.2  53.3  64.4  54.5  34.6   55
2020-02-10  66.1  66.2  63.3  68.4  45.5  67.6   55